[
  "Okay, I have you one. Is this YCD wax, um, me T, 2024, January 17. Um, let's see, I'm going to start from the top. I actually have to move my plate to the bottom. Yes, that's a question for here. Um, and I think, yeah, we start with the, so we do not go out, you know, thank you. Thank you. I have a few updates. One is that I'm almost done with the competitive evaluation for fleet visibility and I did link the issue, which has the FIG jam file in it. Um, it is actually very, I hopeening to see what the other products are doing. I won't mention their names, but if you're interested, take a look or just wait for me to post the summary. It's probably gonna be faster if you just wait. And then a couple of things that are coming up. I wanted to get some eyes on to see if anyone has worked on something similar. One of them is that for the fleet dashboard, we're going to be adding a filter to filter by tags. And it's going to be a global filter for the dashboard. So it will filter all panels in that dashboard. Um, if anybody has worked on something similar, I just, I would appreciate your feedback on the placement of the filter there. And if it's clear. And then the other issue is a CSV export for time period. So we have, and the fleet dashboard, one of the panels is allows you to export the usage information as a CSV report. And then from there, people usually take that and like create internal dashboard or filter using whatever other tool that they're excelled or something like that. And now we want to allow them to choose the time period rather than it just by default being previous month. So I'm going to be working on that in this coming milestone. And that's more of just sharing for awareness. Yeah. If there's a good. Now I'm going to talk about the the filter while the filter placement. I'm trying to find the information in my brain, but I think when when we work on. Was it an environment dashboard was. Yes, environment dashboard. I think so. It's just that too many features. I think it's better if I just write down because I need to put an information in my brain. But I do have some feedback about this and also just some. Social validation that was done before. My question here is you have the the filter. That drop down component. Yeah. So you're thinking the future you're going to have more you know elements there and you why if that user can interact with. If we do it would only be one more and it would be. It was time you could filter by some type of time period. Those would be the only two that would be able to impact every single. Data point on the dashboard. But have you played around heavy instruments and with the that filter bar right the search bar where you have like the tokens and chips. Like what we have in merge requests the issues view. And if so why was the drop down. The option that you. Sorry everybody it's like dinner time. I've been to the computer for too many hours and like I'm like. I'm going to need to find out. But anyways, why what this instead of the Mr. Bar. Yeah, so we use the filter bar on the runners list view like the typical view that you come into if you go to the runners page. And we received feedback that. The experience filtering there isn't ideal because with tags. Specifically with tags every single time you go into that bar you have to add another tag. You have to say filter by tag add the tag and then say filter by tag add the tag and there's typically a lot of like there's pretty common sets of tags. So by allowing them to see that in a drop down. I don't know if I added a search bar in the this the menu. Yeah, so you could search for that tag and kind of like stay in one place and do it all at once. And then we just found we've also heard that it's not as discoverable when it's in the filter component because you don't know what filters are available to you. So I'm starting I haven't really edited what that page is going to look like in the future, but at some point we will. I'm going to improve the filtering for that list view. I don't know when it will be. Yeah, got it thanks for the. Take sort of insights. Yeah, I agree makes sense like you don't know what you can filter by right we repeat that. I feel there to search bar. Yeah. How about you also like show fields like below this. I'm mentioning all the tags that are selected because it's not a crowded space you have space. Yeah, because I mean, because this is the only thing that it's being filtered by and you just not being able to see all the tags which are selected. I would say that is problematic to click on the drop down and then get an idea about what this filter is all about. True, that's a great point. Initially wasn't planning on showing them all, but I think I could play around with just showing like the chips. Yeah, like the actual labels underneath. Yeah, I think that's a great addition as we to come and chin and then I also have just really really minor feedback. I just like I like that you're starting to play around with the drop down because I also could hear from you that the concern of using the current filtering bar patterns. Throke it love and then I know that we have a little bit of minor usability issue on that so I could totally get it. But I think my problem when I saw the design was like because I didn't think that the drop down is connect to the whole page. So maybe you could consider I don't know I'm just thinking out loud maybe adding a small borderline below the drop down so make. More visual higher to keep there would be helpful. Yeah, that's a good idea. I've also noticed a lot of other filter like when you use the filter component there's a gray background. Yes, I could try that out to. Yeah, maybe that would help like I guess, but I need to I need to see but you can definitely play around with it. Okay, yeah, thanks for the feedback. And then the one minor thing I wanted to say is I would be curious if people would clue into that being a filter more if it was on the right side over the left because I feel like filter and sorting place and get lab always seem to be on the right and I'm wondering if that would make it more clear or not. Okay, I'll try I'll try that too. I wasn't planning on putting this through solution validation. But now that we're talking about all the feedback I'm wondering if maybe I should just do a quick on. Unlaterated test. I don't know. Like I don't really know if I want to do that. I think it's I think it's going to be good. I just think if you have something coming up like any research that you have coming up, you can just like plug this question in. Yeah, because you implementing the very first version will not be problematic but later for making improvement. Blood this question into any research that is already scheduled. You don't have to like do something like dedicated to this. Yeah, that's a good idea. Okay. Well, thanks for all the feedback on the spot. I appreciate it. I will give it to Emily now. So I only have one announcement since I spent last week watching all the unmoderated interviews. What we've closed off the Kubernetes dashboard views with our improved preview that we were testing. We found out that users really liked it. They were able to troubleshoot, especially like the pod area a lot better than they were. Before using the single stats. So it's a great addition to the cluster UI. And the next steps are actually to work on moving this UI under the environment details page because we tested this on the environment list page. But we know we're running out of kind of space that page has a lot of problems with things loading and adding a big tree on that page is definitely not something we want to do. So we want to test out moving this over. And then also crafting up a more complex version of the tree just to see how it scales. But overall went really well. And I wanted to give a big thanks to Will who recommended this unmoderated test. We were able to complete the study over a holiday period, which I know is usually a slow period for user testing. And we were in to initially accepting to close this off in 168, but we did so thanks again, Will, for the recommendation for this. Yeah, thanks Emily. I did want to add here that you know, I think this overall process was really valuable to go through because. As I wrote the doc, we were originally planning to develop a whole another page. So we're going to have to like go through foundations team to try to get approval. I think Sengen is probably really familiar with with this process based on everything that happened last year. But through like Emily's design process and like collaboration with the P. and Victor. We ended up deciding like let's just keep it on the environments page instead of like having another page. But we, you know, have to like surface to users. So overall great work. If no one has any questions about this, I can pass it over to Vintka. Thanks Emily. I was looking for the link to your design. When I got lost in the position of the addition issue. Let me, let me post link to the figma actually because there's a tiny figma links lost in the issue, but I think it'll probably be easier if I just link directly. I mean without looking at the design, I would just share why I was looking for it because. You mentioned a good point like overloading a page is definitely not a good idea, but I was looking to understand if there is a possibility to provide a toggle between two views. Yeah, well, that's actually what we're looking to do in the details page. Like I've all between two views or two views you can access the problem with the list page right now as it has already so much information that I think added more information into it. Yeah, me, but it's the table overlocked page. Yeah. I just saw the tree view design also and I think it looks really it reminds me a little bit of the pipeline view like the I don't know what we call that tree. It looks all like a tree graph. Yeah, the graph I guess. I think it just looks very good lab. Yeah, I thought you did that was my first reaction that this looks like a graph from good love. Yeah, I used inspiration from that pipeline jobs graph actually because it's the only one in get love. I knew that kind of related size like I'm going to just use that as inspiration and see if I can work this tree into that design. So there's still a few small UX issues like think we have to clarify the arrows a bit more but yeah overall starting from there I think was a really good starting point. Thank you everyone. Yeah, coming to my point so Miran I you were able to make big changes to the way to boost management experience. I know that we are still calling it beauty find a far UI but we ended up like also doing some back in work. That was long pending which was around adding descriptions for variables so that it's easier for someone to you know find a variable that they're looking for because they might be. One with similar like a bunch of variables with kind of similar names that sometimes users create and it's very difficult to understand it is. Through a glimpse that which one was meant for what and why they were created. So now that's going to be easier but that's just one and we have made improvements with validations added a lot of them. We have improved almost like a bunch of health decks and changed than the interior the behavior of the input boxes made the drawer more pajamas compatible and also like contributed to the guidelines for jars in pajamas as a part of this. Overall this was I think a very successful one and we enjoyed a lot so expect a blog from both of us coming soon. The next one that I'm looking at right now is most dream research. I know that I've been talking about it in a very long time but it was really difficult to get people to speak with but I'm just very happy that finally we do have people and this is for the first time and. I would say ever that we have so many people who are willing to share that feedback about most trains. I'll be concluding this research this week and posting the analysis next week or like mid-off next week and I have a lot of insights that are valid for very different teams so just stay tuned. And that's all. I think I can take over and then just voice a. Bonnie's. Notes here they could use not attending. I think most of you have seen that you share the job token. Designed right in the CACD UX. And oh sorry this is the CACD UX. I'm talking at the Google level yes that's exactly the one so. If you haven't had a chance to provide them feedback. Please leave a comment over here the designs. I'm just dropping a couple of comments here and actually press that you know that they managed to use the design patterns and the whites it's really polished. I think there are a couple of things that we can provide feedback on especially on right. I'm just going to ask you a question on. Ording and then smaller interactions. But overall through nice to see them first prototypes them first design. Issue out there in the wild so. Good job Bonnie and also thanks for being there for more supporting them as them onboarding buddy. they made a. I don't know. The way they like explored all the different use cases for this feature and went into the real depth something that we missed the very first time when this this feature was being built on at project level. And we kind of built upon it over time but looking at how they made all those considerations. Before them very very first draft it was really commendable so yeah I appreciate our work on this. Yeah really cool. I'm going to leave a comment here in the document but also in Asia for them I think a good next step is to you know move that acceptance criteria and the comments that she's living in the designs area to the issue description because right about the behavior about the rules. Just the over our functionality it's good to have that in the Asian description. But if you haven't had a chance yet to review it please support Bonnie. And as you also post some questions and scenarios about the CI job token work. It's in I think is the validation issue yes this is the solution validation issue. I think you had a chance already right we to work with them on this one. Right yeah the noise was a really good question so they still has open now. I think Marcil and I we answered most of the questions almost all in fact I invited Marcil because I did not want this to be heavy on my perspective I just wanted someone to challenge what I had written. And yeah I think they has all the answers but still if somebody feels differently I would really welcome you to post your answers here. And Bonnie let us know because you probably watched this later on. And then there's two more point to additional points here she's also mentioning an next steps for that CI job token issue is to create a validation plan and start from the clean the validation so they can refer to Emily's word for dashboard on this one. Emily do you want me to voice a comment you want to voice a comment I never know how to what to do yes. It was just a funny needed any context or feedback around the solution validation that I just did a feel free to reach out and I can chat about it a little bit more. And I just have and if I know not really it's just a comment to tell them that they should create the recruitment issues so because it's not easy and get in touch with Erica. Is it Erica or will supporting the. I've been to Kyra to do to you. It's Erica. Yeah, it's very fine. Oh yes, since they also worked on the scar card and they referring to the one had a chance to see that. And I've cost more aspect that one of the suggestions of the recommendation that she's the she. That's a very good question. So, I'm also good to see right that. We'll mention an engagement also for customers on the community on the work that she's doing so think overall what they has been busy they hasn't had to just join this call us. But it's nice that she's also able to update us here about work so. So. And then if you don't have any questions, I'll pass it over to the studio. Thank you, Sian. So I have to item so the first one is about the think because I shouldn't that we did last week. So it was really great. We didn't chat about any design relevant elements because it was intended to just become a more of a technical discussion. Who was full of this question around how to use API should we change architecture. But I think it was great that I could hear a lot of from back in engineering perspective as well around this project. So. Okay. So it was really cool and we wanted to make sure that we're aligned on this in terms of the project planning perspective so we're working on the proposal from the back end architecture like planning so Bobbi was working on it and then we're also discussing. Shortly after the call and then we're keep discussing around this so the long story short while we're discussing at the moment is like how would the CIC catalog would like to become is it like get left catalog that includes a lot of different elements inside. One catalog or do we want to speak to become a Gillette CIC catalog that includes the ICD components with the city steps the city template type of component. So it's more of a discussion for the future vision and I'm happy that like we're discussing this so that we can make a proper design and product planning so that we can work on working towards the roadmap. And make sure we're aligned on the same goal so it went pretty well in my opinion and based on this we so it's only the empty issues so far but dove and I started to think about like we should validate if this vision really makes sense or not so today I just really quickly create an issue that the research issue service and deeper now. But I would probably need some of your feedback because we wanted to take this opportunity to test things out that is not exist in the market as well as it's not part of the product but we wanted to make sure if it is really aligning with the users needs or not. So it's that and my second item is also more of an FII that I also went through the solution validation it was during the holiday season and it was a moderated test or went fairly like well and. The good thing is so we wanted to test out the different visual by representing the component so currently if you check the CSE to catalog it shows one project in a row but we are asking ourselves like is it better to show the component inside the project. So it seems like it was well received but I I taught in one unrelated question to this research that how would you filter and find the components that are created by your colleagues to test out the filtering experience and actually we got a lot of constructive feedback on this we need more immediate action item. So yeah, but it was a good test and thanks Eric, if you're listening to this call for helping out planning the research issue. So yeah, if you're interested in let me know if you have better idea on how we are going to improve the filtering experience I think it would be a whole topic that I may want to share in the CSE to review meeting at some point. Any questions if not. I don't have a question you mentioned that you would want some help like some feedback but where do we go to provide that. I don't have a really well described issue but I have created one empty issue so I'm going to link it here. Where is the past sorry too many meetings. Thanks, Bill. Okay. So this is the issue that I'm going to work on in the next one or three months and I want to really revamp the whole filtering experience for example on question three needed tap here. And the second question like how does this filtering tap with the search full working well together and I'm pretty much going to start about using this pattern so I'm happy to explore alternative UI for this. Thanks for asking. So move over to hyana. So switch word updates we're seeing hiring. And the update I want to give to the team is that you may sort of change is to the role requirements that you can find the kickoff issue but also they'll review with you because most of you are part of well they're really team right. So the big change is that we are only interviewing or going to be hiring intermediate product designer so when assessing right in interviewing the candidates and also fill in this for a card. And we are moving them to the pipeline into the interview process considering them intermediate designers and also make some updates in which the priority of some of the skills both the soft skills and hard skills for this role so as you can see here. So 3 and 5 three to 5 anyways top 5 the theory skills is foundational research. I think for switch board there's a lot of have a lifting that needs to be done. And a product designer inexperience in research is really important they need to be very strong collaborators with you know the image and new in all the designers. I'm mainly looking for some on the has worked with the design team before or at least you know had some fair designers. We have interviewed designers that they were like the design team of one they were the only first designer in you know a startup etc. I think that especially for if you think of where switch board is right now where we are getting started with a lot of the core functionality of the user experience someone that has you know a bit the more of experience in collaborating with our designers to get the understanding the insights. All of how to use a design system that they are used to you know just figure in things out with a team think that's essential. If they are not already technical they are interested in the nation and CSS. So I'm sure if in your score cards you're interviewed you talk about that about those skills but. I would like them to at least. The you know proficient in basic HTML and CSS that mean to they're going to have a better understanding of design interactions that they will be able to communicate with the front end engineers right about the components that. When review merge requests they will just be able to jump in and. Do the work that we've done. And I already mentioned the usability interactions that we did to design system and experience working on complex products before I was really looking for someone that had the depth to experience. That's always tricky because it's a little bit such a specific work that you all do here. So complex products that can be like working banking you know and compliance in anything that really requires them to dig into this. And that's a messy hairy problems and showed that they cannot lie design iteration. To you know, propose a motion that they can use research skills that they think collaborate with their teams anyways involve engineering in their design process so. And I'm not sure that's what I'm looking for. And then I still have skills technical skills in general right. Like anything outside the scope of HTML and in CSS. As I mentioned, really nice if they have that tool that's to be experience maybe they're a user of GitLab maybe they I don't know the coming from one of our competitors. And also body and platform workflows or admin platforms experience that's also nice to have I think before one of my mandatory skills was that they had experience in onboarding design. But very tricky to find and combine all of that I think it's we make some tweaks there to make sure that we're not finding the right candidate on paper but that you know we find the right person for the job and that for the things that. They they need to improve this was an engineering proof that we create the opportunities for them to gain those skills. What changes I think to you mainly is you know only intermediate so if you think someone is at the intermediate level but they're like I don't know early intermediate or I don't know a very strong intermediate I'll like you to highlight that in your notes. And also when I say intermediate is like a GitLab intermediate right because a lot of other candidates that's. We interviewed recently especially end of our last year which was like two weeks ago. They had a title senior but they were like not GitLab senior right so it's difficult to not difficult but we have to. Kind of set that expectation with the who the candidates so I'll pause now see if you have any questions and if any obviously since so yeah that can I line. The expectations for the upcoming interviews. I just have one question I really haven't been getting any interviews for this role. So I was not sure if that was something was missing there or I was not sure. Yeah that has been the challenge and it's also why. We were making this changes to the the requirements. I've interviewed only a I don't know maybe. Six eight candidates in the the last four months that's not a lot right because initially the candidates that were being as creative that were qualify. They were and then that's going to answer to will question to expensive or there were two senior right they were good designers but switchboard is an area that. If if we put someone that is too senior they're going to finish the work like in a year and then what. We cannot risk like getting someone. Put is a one there so that's to be born right they it's a it's a problem area where the designers the design and they need to have them for growth right and need to be able to learn also in the fly for example. I think that's the experience in research but have never worked with a research team so they're going to collaborate with will right you going to learn something. So yes for this this role we haven't had so many interviews we had candidates that were screened and we're qualified and they moved to the team interview I think. VT coming me soon during interview a few of them but then rejected. After after a couple of of interviews. I think that's the first question that's great. I think you you kind of answered by first question so I did add a like another question. And then you know you've done you know you mentioned six to eight different interviews with some like more senior candidates. Are there any. Concerns that like intermediate candidates will still be able to match up well with what you're looking for for those top three to five. mandatory skills? Yeah, I think so. And that's the assessment we've made after having these interviews, right? And after also looking at the book of applications that we had. Right. I'm sure if I remember at some point I mentioned like I'm reviewing a thousand applications because a lot of people were applying. And as I mentioned, they are seniors where they're like not good senior. And if you will have the experience working complex products that we need or understanding research methodology etc. I do think we'll find an intermediate candidate at this level because farm and but correctly like Gina. Gina Emily and Tunjoon, right? You, the three of you, join as I think to be the level, right? But you all came with a very strong graduate, very strong experience in various specific things, right? And another thing we have to look at is that this team, you're all seniors, right? So looking at the business when we hire yet another senior in this team, right? There's all you're going to be so many staff and manager opportunities in the company. So we also need to think about that, right? The career path and development and room for the road for a new person in the team. So that's really it to the point I mentioned about, you know, compensation expectations for people there to senior depending on the location factors but also budgeting and career progression in the initial. The, as a two question or will. Yeah, thanks for going through that or me. And of course. And then a question. This is a little bit out of scope and if it's something that we can't talk about in the recording also in time of that. But as you mentioned that there's a lot of seniors on our team and that there's, you know, not every. The growth opportunities are only going to be there if there's like a certain amount of openings and etc. Are there any is there any work going on to maybe change up our. I don't know what the word is, but basically like the growth opportunities for product designers because right now like you're saying you're senior and then you're either staff or manager is there going to be like other opportunities in between that. Yes, I think we have a, I'm not sure if the merger class was version of things, so but I know that Valerie and and better to work here on the principal product designer, which is staff plus. Right, similar to what engineering and also product has that something that Christy was also working on because we need to make sure it's right that. Let's say after. Actually, you get promoted for example to senior product product design manager, you could become a director, but then what's in between right. It's a limbo that. That we need anyway, just this, a clarify and I know that this is part of the discussions. That leadership had at least, you know, last year, I'm not sure yet when this will become a. Let's say something that is in the handbook right of a job. Because we also need to have the business need for that. Right, so we didn't have staff designers in the past, right, we also didn't have senior design managers, so as we grow. We also have to make sure that we are not. We're not only adding people there are too senior because that also means we might lose them right at some point. That's all part of the changes for this particular role and also mainly because I think switchboard is complex, but it's not as large as for example. Verify right where yeah, you have a very well established set of functionality that yeah. That will require expertise that requires more senior designers. So yes answer a question, but I don't know what. Okay, thank you. Oh, the. Um, thanks for your questions, by the way, and I know that we are at almost a time, so I'm just going to drop my question here. I discussed this with some of you already, but. I want to see if you're all can help me. I have to disemble it to switchboard by the way, but I have to complete a UX score card as part of a Q4 okay are. That will require me to validate a job to be done right run a score card on a job to be done for a product area outside of CI to the outside of switchboard. I can pick anything, but I want to pick something that relates to verify in release. I'm sorry, verify any environments. It's an a room number that that changed. And my question to you is. Do you have any suggestions do any recommendations on. Cross stage job to be done that makes sense to be used for a score card that can help us, you know. Experiment or at least a sastic with the that that user experience. Taking that the recommendations will be beneficial to your product areas. That makes sense. It's late. What do you think. I have the same suggestion here that I shared with you and everyone on one. You help me like come up with this. I discussed for the designer with the other team of the other team which is go interviewing that's how like. I did not have a chance to find this for testing the usability of merging experience, which is a very wide experience. And I can totally give you the highlights the tags from the up to you that validate this. I would just need some time maybe tomorrow. I think appreciate it. I was thinking, I didn't discuss this with you, Sunjian, we didn't have time today, but I was thinking of a running job to be done, of the Reyescore card, also for one of the jobs to be done in Create, but related to the pipeline, like the editor experience, right, either the coal suggestions or using, I don't know, VS cold, whatever, using extensions, because I think that could be interesting to you, but they don't have jobs to be done for that category. So yeah, that's the type of thing I'm looking for. So I'm thinking secure could be cool. I think that could overlap with verify, just thinking about security widget, vulnerability, that all can expect to like, commit in pipelines. Yeah, that also makes sense because I think that's the way that you will or the Erica that it's Erica, that was working on a study or I think, and I think you see eye adoption and something about that related to related security and compliance work flow. Yeah, it's definitely Erica. It's Erica, right? Yeah, okay. Anyway, I forgot that, you have wheels. Part of the agenda, I'll just, oh, for now, unless will you want to, yeah, voice up coming here. Yeah, I saw that you added the link to the just to be done. Yeah, we'll file, so I was just kind of like, scrolling through it. And I came across this one. It looks like it hasn't been validated, but it touches its technically under distribution. So that's involved with, like, actually installing, get labed and then it touches on Kubernetes, which is covered by the environments team. So it looks like there's a couple different, like stages involved. So I don't know if that might be another area to consider, but unlike the one that Vita got had shared, I don't know if this is like, it's got the evidence behind it as much as their does. Yeah, thanks, Will. I linked here the, the, the, the objective on the file. Yeah, I'll do some digging. You could just, you must be some additional information in, direction pages or these categories, this area, but appreciate the feedback. And then over to your world. Yeah, I don't really have a lot of updates. I did want to just add to what Emily said, earlier about our solution validation study, that I think they did a great job collaborating with Victor and myself on this work, and they was extremely efficient getting everything done, especially around the holidays. And they also did a great job like running the study in user testing and then providing us with updates on like each participant, asking me for feedback on like whether they needed to like, you know reject certain participants and kind of get new ones in, get higher quality feedback. And then they also consolidated all those individual sessions until like it overall. Summery, which was really detailed and awesome to see. But that's kind of it for me. Thank you, Will. And Emily, thanks for the shout out. Thanks everyone. Yeah. Yeah, I never worked. I mean, we want the, never, we wanted to, never, we want to. It's going to be forever on the internet. Thanks everyone for joining me. And first thing a little bit of time. Hope you enjoy dressing today. And that's me, Linda. Bye.",
  "Okay. It works. All right. Okay. Last team meeting of the year. I just want to start off by saying, it's been a crazy year. Thanks for being a crazy couple of years for everyone. But yeah, I'm really happy that we've made it. We have the people to be working with you all in 2022. Looking forward to much more next year. And I just wanted to ask this is anything that you have in mind that I'd like to share a ball's what you're looking forward to. Work related, no work related in the next year. For me, for example, I'm really looking forward to the GitLab. What are we calling that now? Are we calling it summits? We're calling it contributes summits, right? Yeah. I really hope it happens next year. Making all my string blends around it because it'll be super cool to make you all in person. But also, yeah, just to meet again, some of other colleagues in the subject. I think that's a high light from my GitLab. GitLab was just but also to higher the designer in switchboard. It's been a few months and boredom. So these are like my plans. And also something I'm looking forward to. And it can be quite annoying to have your manager ask you like, What do you want to share? But does anyone have something that they want to share in this last year? I'll have to say, was summits as well. So now I'm going to try and think of something else. But again, that's one that I really want to share. I have met many people from my immediate team. I have met a few people from our team, but it would be nice just to for the first time ever to meet like a big jump because of people I work with in person. Which will be really nice. I'm looking forward to figuring out what fleet visibility will look like next year. So like the first time I feel like I'm dealt with a brand new. Not really a brand new feature, but it's a new category for us. So it's the first time I've dealt with that. And I think it will be. Very fun to collaborate with a lot of groups because it's really cross group. Yeah, so I'm looking forward to collaborating and figuring out what that's going to look like. And some it will get on the summit train. Eric, could you want to say something? I was just like, I didn't want to. I said, no. Okay, then let's just be grateful for Eric. All right. This year and more Erica next year. To. Awesome. I think, yeah, I just before we jump into the agenda, just want to say I was not going to take some time off next week, but I will because it's just today's. And in case. Any of you, I know that Emily asked for my coverage for a few days, but if anyone else, that's going to be watching this recording. If you need a me as your backup simply assign yourself in get lab as busy and I don't forget, you know, to do that and also link to your coverage issue because. Yeah, from not able to cover it, we can point people in their requests to the coverage issue and it can leave comments there if you need it. Okay, then we do a start on top start from top yes, then over to Gina. I have a reminder that I'll be out of office for probably the longest amount of time I've ever taken here. So two weeks. And I linked my coverage issue there. Thank you for people who are covering for me. And then I have a few other items just for some ongoing work that's happening in early will in January when I come back. I'll work on a competitive analysis for or competitive evaluation for fleet visibility and. I will not state the competitors there, but I will be looking at, but you can read them. And then go into that issue if you want to see more Darren has already added actually a lot of screenshots. And then I'm also working on auditing existing research in summarizing that into a video about kind of like the broader pipeline performance or how to optimize my pipeline. Erica has done a lot of research in that area that I'm also going to be just like summarizing in one place. And so I'm not to my surprise there is a lot of existing stuff so we don't have to talk to more customers which is also nice because the problems are already validated. And then lastly, I worked on I worked with Graham and Alana who are two new product designers because they wanted to shadow someone while reviewing an MR so. And it was a really fun experience for me we were trying to get pipelines to be in the right states and I was like googling on the spot and. We were all just like working together they had GDK up on their instances as well and we were working together on it and it was very valuable so we. And I'm hoping that I'm able to add this officially to the onboarding template for product designers. You're welcome to jump in there. I have a comment on this one can I say I left a comment in the merge quest you know just in being a big company for feedback because. I will this help you and board bunny and they are do something similar. So I think they had this week the first merge quest shadow call they also were taking a call for like one hour so they might have some. Some feedback and I think it's a great addition because to your point right now that designers are assigned to randomly assigned to merge requests reviewing something out of sort of your stage. And even can be even scarier so I think in general doesn't opportunity to do that for us to also define when shoot that happen right and who should help them with. She'll have to mean the process so thanks for that mark. Yeah and also I met with be this morning and they was saying that she'll create another remark because I they had some larger ideas of how to. Kind of like time box a lot of the stuff that we have in the template so there's going to be more changes. After that but we were able to connect at least on the small change that I wanted to bring in. Throw on the same page there and she'll build on it. And that is it on for me. Emily. Well, um the first one is just an FI I that we're starting a new unmoderated study in 168 for a tribute on the Kubernetes dashboard. We're seeing like a lot of competitors have a tribute of this and it's a concept that we didn't initially explore when the Kubernetes dashboard was first validated so it's something we kind of want to. Sneak in there as we're working on it and a big thanks for well will's been kind of helping me with the screen here for this as well as the scenario so. Thank them for their help with this study. And then. The second thing I wanted to say is Andrew one of the friend and engineers on the team invited me to a Kubernetes meet up in Toronto last week which was a lot of fun. It was very very technical so a little bit above my knowledge. But it was nice to just go kind of network with some of the people working in this area making connections and we're also talking about maybe presenting our Kubernetes dashboard at one of these in the future. So I'm going to meet up with a Vittica to see if this is something I could do speaking about and partner with Andrew so they can kind of answer all the engineering questions that come up. But it was a lot of fun and I haven't done like an in person meet up for a while so. And if no one has questions move to Vittica who's not attending. So do you want me to voice it for her. So it's I'm talking so them first point is there's a discussion going on in PE on the time we show for duration created at started at and it'll be helpful for some early-career and Gina to for and she's like the epic for improvements. And then. Gina I noticed yours is read only but since we probably have time we can. Yeah, I can voice it. I brought this up. It's actually a really interesting issue. I would recommend going into it because it basically like the users saying that weren't misleading when we calculate duration for pipeline. I brought it up with a flea team just because we have a lot of overlapping features that have to do with duration and runners and wait time and everything like that. And I left a comment for Vittica because we have some specific customer recordings of how they use duration metrics and why they're using them to optimize their pipelines. And the just a summary of what the fleet team talked about. We kind of agree with the user that it is misleading because we're not including pending time in the duration, which is. I'm not saying any kind of weird. But anyways, I just they had asked me to jump in and just include some. User stories, I guess kind of what most like how customers are using this today. So that's what I did. Yeah, I can bust my comment to. I had my one of my new Vittica today and I told them there are some insights in one of the environments. That's where we searched issue. I think I did that maybe last year with summer. That has some explanation about what the release managers and that's up in the years when looking context of the payments right when they are in the pipeline pages. But looking at the point of production. What do they understand you know of that metadata what why are they looking for. When it comes to. The ratio of the pipeline or you know. Well, when it started running etc. So it might be interesting for them to look into that but also connect with you and you might have a lot of updated and more insight in that. But just as a reminder, I think related to what you said there's some connections right about those information that we need to make. For many different personas, a lot of people just go to those pages, especially the pipeline view. And look for something very specific. There's a wanna see one number or one tag. So keep that in mind when making this and coming nation, let's also look at the insights because we have them and if you're gonna find it. Ask me, oh my, oh my. Oh my no where it is, but it's it's there. And then research project is the environments dashboard redesign. I think. That's not the group level environments dash that's the original environments. Okay. Yeah, yeah, I think then you all have been a full school started and I finished that was before you join. And I think that's the main thing. But there I remember documented that in the off jail because we specifically asked about the order of the metadata and also. What they want to do. Why some of this info is relevant. But anyways, mission like one or two insights about that it's the environments dashboard redesign. Also just another small note about this. I know that the issue was about the pipeline duration and. What another thing that I was thinking about is that a lot of these metrics are. I think more useful at the job level rather than the pipeline level because each. Even if the same pipeline runs. A pipeline is designated for a project. If that pipeline runs multiple times the same it might have a difference at a job set run every time because jobs can be skipped in it whatever. So yeah, I think it's it's hard to think about this at the pipeline level just because there's so many changes that could happen with each run. And I can move on to our next point. We're done. And the next one is we need to get started. Butifying our UI in 168 there's many MRs that are merged already and now have validation in the form of that work. And I'll voice Bonnie's comment here if you want to take a look at the list of items. Maria and them are working on. I think that's just a question for Vita go and to watch this. I think it's the opposite. I think it's the biggest comment for Tika's comment to Bonnie. Okay, everybody. Yeah, that makes sense. Yeah, because Mida is in front of an engineer in Tinas. No, no, that's right. Mida is a sorry to many to many teams. You're right. No, so we're confused because it could be that 168 beautifying something with Hayes Lumi. Maybe with Mida. Anyways. Yes, they can take a look at the agenda. That's it for. Yeah, so Bonnie and Sinshu are not here. And then my only update for us which more is that still hiring, Steven interviewing. I don't have an interview scheduled for well this year and more. So hopefully by January we'll pick up with more interviews and fingers crossed hire someone. Good evening. And over to Eric. Yes, so I posted the link to the draft of the report for the runner and CI builders build. Belled feature prioritization survey. So we did a canos survey with 11 features to see how they got prioritized. The signal we would be looking for is that there was like one must have that we would want a champion. Actually, they were all either attractive or indifferent. So like kind of cool, but like nothing like that we have a clear signal to deliver on. Looking across the ones that were in the attractive bucket versus the indifferent bucket. We have a signal that users want AI assisted things like for example like custom dashboards are actually not compelling because it's more work for them. But if it can be like AI assisted then it's like attractive but still not a must have. And so Darren and Gina and I are going to go over that report and depth tomorrow. But I thought I was like give the high level overview that we don't have any must have so I think it means that we're on the right track with like figuring out those little optimizations suggestions which is a read we got from that qualitative study. And we wanted to do this just to make sure that there wasn't something that was like so cool across this bigger sample of users that we missed but we didn't so it kind of doesn't change the strategy in a way. I've also noticed that the not the sample was mainly small medium businesses. And I want yeah which is fine like I kind of had the assumption that they had different interests than the enterprise customers that we're talking to that are self managed. I we did have yeah it's totally right very keen. The thing is I think this idea that it would create more work still holds. Yes. So I agree but I guess my point is I feel like they have different needs because enterprise customers first of all are typically self managed bringing a ton of runners. So when I look at the features profile does attractive. I would imagine runner usage and compute minutes are higher up on that then for small business. Small or medium business. Yeah yeah I don't I I assigned a fidelity of signal score to to kind of help us make sense of it. I think what we can do is really look at the the the five features that are have strong. We have strong of it like a strong signal that they're in different to that's kind of the most. Okay, well it's like okay don't invest heavily in these okay yeah oh that's also so interesting though because. The notifications I don't know it's. Yeah because yeah because it's just it could end up really distracting them the notifications parts. Right. And then I think a lot of their flow. Yeah. I guess that makes sense but they're but then I guess does that mean that we just think about different ways of solving for when you're keep performance stinks. Or when your runners are. Erring out a lot like we have to figure out a different ways to give them that information. Or at least make the notifications like customizable as opposed to like across the board so it's like you don't want to get like all of their runners aren't important to them it might be like only the subset so like allowing them to. Opt in. Yeah but in model versus like opting out. Okay. It's like just we did just be really wary of creating. More things in there already busy. Yeah I don't I totally understand that this is really cool though Erica I'm going to look this is my first I'm actually seeing it so I'm going to look deeper into it and I think our meetings tomorrow. Yeah yeah and let me know like what what to do but I and I think it's a really good critique of the. Of of the sample that's like really on point I just think that. The the problems that we're seeing with those features should also have a problem like notifications for enterprise level but would skate that would scale that finding kind of right definitely yes. I was looking more at slide seven of the ones that are attractive because I figured the ones that are set they're set at week there I would have thought that they would be higher up for enterprise users but the findings that inside a definitely relate to all I totally agree. Yeah yeah so we can decide I think the thing is we didn't get a clear I mean I thought we might get a clear like chibby in here. I'm not really important that we don't want to like sprint towards any one of these particular visions and I think that like this AI assisted is the way that we want to be thinking about it. Like yeah behind the scenes they just wanted behind the scenes. Yeah okay I have some more questions but I don't want to take up a ton of time. I'm not a baro. Cool everyone don't you care. Yeah okay. And let me know if you want to sink today too. Okay. Yeah. And then or just slack about it and then the other study I'm working on is this conversational AI study which is like a team of researchers and I'm working with ops folks. And we are asking we did like an intro interview and then they're doing a diary study where every two to three days they let us know the tasks that they performed with conversational AI and how it went and they're giving us screenshots of those. And so we're getting a sense of how we might use conversational AI in the ops space. Although we think it's not related to performance optimizations like we got a signal that they that's inefficient use of their time. It's more like it looks more like they like it like as an idea generator or like getting the right language to use for documentation searches stuff like that. Anyway, but I'm threading the like really technical example tasks in that thread I linked and we'll we'll be doing the follow up interviews with them in the second and third week of January and so we'll be asking people to like give me follow up questions to ask about those tasks. Sort of put that on your radar and then the next thing is I was initially thinking that we would run that shared resources workshop at the summit, but I think we should do it after the summit because it seems like. I'll be like the only nerd being like, hey, let's work. Look at it. But let me know if you want to go rock climbing because there's a rock climbing issue that someone created. I work our rock climbing. That's all I've got. We can have the workshop while rock climbing. That's a good challenge. Okay, we're too happy with that. Let's go. But I think it's a good idea because yeah, you know, maybe some of us will also take some time off after some it's before right is some traveling. I think it's good. Well, once it gets confirmed, we can play around the summit for that and if not, we just, you know, pick a date in. You don't make you to things going to make you to right. Yeah, and if you work it to, yeah, I think it's safe for. Can we. Okay. Think that's that right we'll. Yes, already off. Anything else we didn't discuss we would like to share before we wrap out for the year. Good. This. Who? And thank you Emily for recording. This. Yeah, enjoy the rest of your day. I'll see you later. Final see you later. See you next year. Enjoy. Enjoy time off. Bye. Bye. Bye.",
  "Maybe you can, yeah. But I don't know where this is getting recorded to cloud on my computer anyway. Yeah, so I was saying that Sunjung, I learned a lot from the process that you were following and other learnings that came from that. And so like we thought that it's going to be good to kick it, kick it off as soon as possible, but not wait for everything to develop first and then think about right up like that. Yeah, yeah. This is the right way to go. Thanks for sharing. So my item on there is free a big and rather radical change from the CACD private catalog. So we we discussed this a lot and this came up and inspired me a lot. I did the journey map exercise and I didn't feel it's right to having this private CACD catalogs go for namespace because we have interviews several self-manage instance customer. It could be really multiple namespaces and not going to disclose to exact number, but it could be a lot of course it depends on the organization's size. And now dove announced this change and this will impact a bit of our product roadmap or the timeline. The design lies that impact is not that big, but I think this is the right way to go. So I was really supportive about this change and yeah, you can see that now we simplify the structure. So we'll have one organization catalog and one open source catalog that is kind of similar to the market. And I have personal updates so you can re-through it. I might need to reschedule some of our coffee chat or 101 if I need to. From next week until the end of September. I wanted to here with you all. So I am so excited. Yeah. Immodges are not working. Yeah. It's mostly common control shift that works for me to show the model or the modus. I use it a lot. I'm not ship story space. Okay, so my Anna is not here. So we can just go through this asynchronously. Maybe we can move to a research them. Yeah. Yes. So I am just analyzing all the sessions from how do we use AI to help users optimize their runner and CI builds. And it was pretty cool. We used like a decision tree process from this book on AI that I'm reading. And basically the idea is if you can put the decisions into like clear if then statements, then you have support that you can automate this workflow a bit. So we didn't know if it would be like I think about this, but that's related to this. And then this is really, but actually it's like pretty straightforward. Anyway, so I won't go into the results. But I'm working on the report. And another come out. I think I'll share with the UXR team soon and then it will come out next week. But there's really good information in there about just the details that people need to make decisions. And kind of the outcomes for optimizing pipelines. And the process is very trial and error. And set it and forget it. That's the main thing. So I think that's like one of our CI learnings just like the biggest thing I've learned. And get lab. They don't think of these things in their minds either. Like they specialize in it. They execute and then they go away. But I think that there's also findings related to how to support teamwork. So I think you'll like their report. And then next week or as soon as I kind of like get my mind into that report, then I'll start working on this. How users are using get lab on the cloud. And we'll do a little bit of a good question. Yeah, could you just elaborate a little bit more on the effort? Yeah. So I'm actually very proud of us as a product company that we're like ready to move into this space. So we're looking at kind of the connection points between get lab and the cloud. And like where the work flowing is. Kind of the tools that users are using. And that'll inform and part of the integrations that we're building. Like, June, which is DCP. But then also like long term what works well in terms of the integrating. And what does it? And that's actually where I think we can bring in some questions about resources and whether or not they should live at the project or the group level like how teams access like secrets for example. Like where does those get stored and get labed? And it is like higher up organization. Because I'm thinking a lot about this new. Chains that's coming related to organizations was to new nodes because that's like the new play with the catalog. Which I think is really smart. Which is to put it up there. But then I'm wondering like what else could we move up there? Like maybe the secrets because they're at their organized at this company level. But that's what we can look into. Talking about that Erica, I like can you like later go in chime into the issue that I've created for navigation. And like share your views there because yeah, we don't want Even though I have mentioned about like taking it out of CI CD. If there's any research that points that we should have it maybe as a part of the main navigation or out to higher level navigation. We should be aware of that and that would help us inform the methodologies that we would like select for research. Okay. I think we haven't gotten that detailed because that's actually like really tactical. Most of the research so far has been like what is a secret. But I'll look I'll look up the lens on there, but I think I won't have much. But I think from this study we might get something. Okay. And by the way, I will also pick this up based on your recommendation. Oh yeah. I'm listening today. You can read that chapter. I'll say it. Okay. I had. No, it's okay. I just have another like full hook question. Are you only looking at get lab. Sassy. There's always trying to read through your issue. And I mentioned that because one of the teams that I work with in enablements. Currently the application performance group is changing their name to cloud connector. Okay. And they're focusing on. Sumpman issues are essentially giving them access to like AI features and things that would be available through get lab SaaS, but at the self managed level. So that might be a good team to connect with. You know, in terms of this research. Okay. Awesome. Thank you. Right. I think we landed on the SaaS. Users. But not. Yeah, but either way, I think they at least be interested. So that's so helpful. Well, thank you. I'm embarrassed that I can't quickly find that in the issue. But it's okay. I'm on the other project. Yeah. So if you want to ping their entire group. I can list the the channel there. And then the P.I. can also list the PM as well. Okay. Cool. I just put thank you. Thank you. Well, go team. And then I have this this note. I have to find it in the, but I'm watching the sessions again and again. So it's coming. But there's just lovely quote about how we made a change. And the details people could see about the type lines completing. And this person was like, I love it. I used it the other day to show my executives that I need more funding for my pipelines. Because I could show like kind of the times and how if we organize things, this would impact the times. And then they used that to find more of our product. So that's like the best. I can look this in your portfolio. Be prepared. Where are we showing the pipeline? Somebody. I'm sorry. Oh, no. I mean, I don't know. But when they was telling me, was that the new way that they can look at the metrics allowed them to make this argument. I need to pull up the, I'll pull up the quote. Okay. It was pre-owned. Any other updates before I go or. Yeah, the data technique. So I don't necessarily have anything. Connected to delivery or dedicated this week. I guess just a. Announce what I'm working on outside of that. Doing some research for organizations that I think Eric had talked about in the US week, the call earlier in the week. So I included the research issue and I've been. Constantly like adding and refining research questions there. And then I'm doing a workshop on breaking changes. Some adding people from different departments at the moment and can be doing that. It's going to be kind of a mix of async and synchronous workshop parts. I was looking for Jocelyn in the list because I mean, given how much they has been struggling with breaking changes and I see them there. Yeah, that was somebody who came up pretty quickly in conversations with the PM that I worked with Sam. they was like Jocelyn definitely let's include her. But if you have any other suggestions on who might be a good person to include. Let me know. Yeah. That's all the updates that I have this week. Okay, so with this we are at the end of the agenda. Anything that someone wants to bring up. If not, then the visit. It's in the meeting here. Bye everyone. Have a good one.",
  "Hey everyone, this is the CICD UX meeting on August 2nd. Starting with our standard topics with the, I had not wanted to mention the Q3, okay, as are being defined and will be available soon. So she'll share more info once the details are known. But two of the okay, as might center around the UX department completing the neuro diversity training and resolving usability benchmarking findings across FaireFI. So does anyone have any questions about those two? Awesome. So then we'll move into the product design section. I can voice Hannah's because there's important notice here about how she'll be providing coverage for switchboard at 20%. So hands on design work, milestone reviews and team rituals. And this will continue until that roll is back filled. And they expect to onboard five customers to get liad dedicated by the end of Q3 which puts a focus on the UX. So during this period, if you need support or she's blocking in any way, please be explicit about what's needed and you can ping DM on Slack where she's most responsive. And then currently working on email notifications and the onboarding flow, gathering requirements to improve design proposals for the deployments page for switchboard. So lots of updates to existing work and that'll be kind of where them focus time will be. And they shared a customer call from Switchboard on Monday. Think I'm next? Yes. Oh yeah. No, no, sorry. But if a no one has any questions, yeah, Gina, you can start. Okay. I have attached a report that I wrote up about the mental model research study. And there's a lot of good insights that came out of it. I'm working on recording like a video and sending it out today explaining a summary of that as well. But right now, one of our next steps is to run another survey, which is in progress and already have some data from it. So finalize the terms that we use to explain the concept buckets. And then we're also asking users where they use those things in their workflows. This will help us get a better idea of really what they think those words are. And then we can also use that to look at like pain points within the workflows that they bring up. And then the next item is that our next big thing for runners to look at runner cost visibility, which is focusing on users who bring their own runners. So we're not going to be touching shared runners on SAS because we use like our own pricing method for those users. And an example of this is like if you create a runner through AWS will provide you visibility and to how much that runner is costing you like the machine and to run the jobs and everything. So I attached the issue there, Darren added like a ton of details. And we're just going to work on scoping it down. But I talked with the team today and we're going to run a think big and think small on this because my goal is to have the process of getting the first iteration for this feature out faster than what we did for the NBC dashboard. So I think I'm next if no one has any questions. So I'm just making progress so so you can update it kind of artifacts for design sprint starting with issue templates and slide decks that you can reuse during the sprints. Just let me know if there's anything design sprint related you'd like to see template it out and I'll try and get to work on some of those. So some of the ones I haven't gotten to are each day of the sprint to those issue templates as well as I'm going to make videos that you can share asynchronously on how to conduct sort of these activities or the homework we were calling. So there's a few things I'm still working on but just wanted to share progress on that. The second thing being our we did internal research on populating a service list two weeks ago now we're doing external research. The good news is the results from both internal and external are really aligning, more seeing a lot of the same feedback from both which is great. So we're hoping to wrap that up in the next few weeks and move on to prototyping an NBC approach from this. Yeah that's a good thing that they're aligning. Yeah that's so we were worried about we were like I hope GitLab isn't using GitLab differently enough but there results will differ but there's a lot of the same thing which is really great. Okay there are no questions I can proceed with mine. So first of all thank you everyone for providing feedback last week on the secrets pucy prototype and you'll allow find our advice design on the same framework profile. The next step for me is to create an interactive prototype and share the link with everybody who has signed up for the OLE Adoptal Program for Secrets and then we'll just keep our fingers crossed to see what kind of feedback frozen. Beyond that I mean that that's a big thing that has that is about to be wrapped up this week so now I can start looking at see a job token and variable work again. Yeah besides that I have a chat with the application secure to team here at GitLab. I organized a meeting with our engineering manager product manager the security engineer from upseq MSF and it was really interesting so I tried to understand how is it that they are currently like how are their workflows related to secrets being fulfilled today with the current set of features that we're offering and they kind of walk through it and also contributed to the user story map that we've been working with. So we definitely have to keep in mind and one of the learnings was that we have to keep in mind the special responsibilities are special permissions that any security uh any any individual responsible for taking care of the security in any team organization would be requiring and that's going to differ a little from what we are going to be thinking for maintainers owners. So yeah this was a really good meeting for us and that's a oh if you don't have any other question I can move on to mine um I don't have so much to share for this week um so we had a meeting last week and this is this is this huge that I learned here is the outcome um so we decided to take a step back and then just like let's just forget about like everything and then we just focus on the user flow and then their context and then see what is the best solution for them and in which context are they starting to author the CIMO plot pipeline or maybe they want to come in to the CIMO and then maybe they want to just make some edit and then probably that's the point that they started looking to the CIME template component. So I'd like to just list down all the possible context and then make a journey map for each workflow as it seems like CINA has one question they want to verbalize your question CINA. Yeah it's a little it's kind of related I guess um I just had a question on the progress of the CISCD catalog and the navigation effort because I saw in that page now that Foundation team isn't allowing navigation changes until January of next year and I was wondering like how that impacts your team progress. I think of of course it's I don't know at this point because we are ready to start to take a step back and then I based on the outcome that I come up with like with the journey map or whatever design that we are going to discuss okay which is the best placement. So the short answer would be no I guess so from mind-resenting so okay probably the project navigation is the best location for this reasons then that means we can still ask for the request for the Foundation Pman and have those conversation back with better back up from the UX perspective and then also from the UX our perspective so I I you didn't think it will be blocker for us but at this point where you just like decided okay let's like a huge step back so I don't know we would be a plug or not just to answer your question. Yeah it does um one of the things I'm in our team call them runner today we were bringing up the fact that our project runners views and settings and everywhere else it's in the navigation like in build or in admin areas still called CICD but same thing and I was like yeah I I'd mentioned that your team pipeline authoring is like going through this and it's been quite a struggle um and yeah I'm just I'm a little nervous considering what I've seen from the stuff that you've gone through already so I might end up talking to you more about it depending on I might create an issue just to get like their input so far because someone actually commented about it on the navigation feedback issue they're like why is runners still in settings for project when it's not in any of the other views so maybe that helps but we'll see yeah so my solution would be maybe you already started to getting more numbers and data and also those verbal feedback from users and then just be ready to have those conversation with the foundation in one year really sure about like okay this is the good place for the runner yeah that'll be my only suggestion thank you yeah thank you my issue is also going to come in so I'm going to join the band in a while yeah and I think to genus one that most things that we are placing in CICD settings I'm not like very aware of what's happening with the other settings option but CICD settings those particular items are facing discovery, discovery, discovery, quality issues and I think we just need to see that what we can do and it's impacting kind of silly person the item that's inside the settings so it's not just about runners and variables it's about like how can we collectively improve the visibility of those items overall and yeah it would be a great chance for us to collaborate on this yeah totally agree yeah I just wanted to add that that are protected environment settings are there and we've had a lot of like user feedback that no one can find are protected environment settings so oh yeah yeah I remember that looking and that one is pretty divin the setting yeah it's deep and it also is sitting in an area that people are expecting it to be in and it's not linking you can't link it to the edit or just we recently started linking it from the edit environment but before you go to edit environment and it wouldn't be there so that was even more confusing I have an observation there that in most of the other products because we did a competitive revolution recently so I was just like passively looking at there are many options our like anything that's placed under settings in any of these sections I actually cascading in two steps and that's not the case with other products they have their settings navigation separate from like everything all together so doesn't feel like everything is very hidden you mean they have it like in a separate like almost on the separate level pile yeah yeah I see what I mean yeah and the one thing I noticed is sometimes we just put things like two kind of figure also when sites the setting and is it really setting or is it something to configure and yet that's sometimes confusing to me so maybe this is a good opportunity for all of us to I don't know just some fun work like settings you why version two yeah yeah well yeah we even talked about just removing protected environments from the settings and just moving it into the edit environments page because we're like that makes so much more sense for just actually in just actually those yeah and then maybe have an overview in settings but like I don't know it for us it doesn't quite make sense while it's sitting there yeah and just some a different kind of semantic grouping like for example verbose tokens secrets they would all of be kind of managed the same way but they'll be scattered all across even if it's on the same page let's see well think of something whoa yeah just wanted um if there any other it looks like research is both away this week so I don't think we'll have anything from them oh does anyone else have any other questions if not we can end this slightly earlier oh that one has a great rest of your day",
  "other. All right, today is the 19th July and we are meeting for CICD UX discussions. There are some stunning topics. There's just one impact which is by me. So in by playing security, we are kind of experiencing something like we are getting community contributions, which are not directly related to any issues. And those contributions, they are not very small in nature. So what ends up happening is it kind of like, and some being in conflict with something that we already have plans for and we try to make changes of that, we can accommodate it like we can take some parts from the contribution and get it implemented. But the discussion has been like going really long on those. And so Jocelyn and I we thought like maybe we should bring it up with the contributor success team. And that's the discussion that's going on there. So probably they might bring in a couple more automations to the process or some additional label that would require contributors to ensure that they at least look up for issues which are relating to the change that they are proposing. And that would also help us make sure that we are not discouraging anyone from making contributions because of course if we just continue the discussions for a month or more than that and just keep on changing, making changes to the decisions. It's not, I would say for someone who's taking a time from their personal time to do this work, it's not a great experience for them. So yeah, I'll keep everyone posted on what we decide or changes the contributors success team decides on rather. But this is this lack thread, but it's all happening. So if you want to just follow up. Yeah, Gina, do you? Yeah, because this happened to me as well and it gets a little frustrating especially for designers because we tend to have to go back in like retroactively design based on the contribution. And for runner we saw it was the same contributor every time who was doing it. So we ended up talking with the contributors success team and then met with them plus the contributor and kind of like talks about our roadmap so that we talk about our roadmap and also what they were thinking on from their roadmap so we can come together on those things. And what I suggested, I mean, obviously we have to like be open to them contributing. So I suggested that if they have like a new feature that they want to create, they create an issue first and tag me and that puts a lot of responsibility on us but I also think it gets us involved earlier. So that's what they've been doing lately and it actually has been helping a lot in regards to like making sure it fits in with the features that already exists or that we even like see coming up in the roadmap. Yeah, that's a very relevant example. So like this is case by case like for your team writing but to make sure that we come up with something that's generally applicable to everyone it's adding. Good for the contributors success team to come up with some new rules probably. Okay, if there are no more comments, let's move to product design. So for the first section which is which for Hannah has some updates that she's working on the backful requirement for all this position and if there's anything that any of the team members have been working on with the relief, they can just let them know so they can work on finding alternatives. Any other, I think NFI for Emily that the bears would be rotated by the end of July and for the rest of us as well of course. Yeah next is Gina. Yeah, I'm going to drop a little bit early from this meeting but also the things that I've been working on are mental model research for runners which I completed and thank you, Erica's not on the call but if they washes the recording, they helped me a ton with this project. So yeah, thank you, Erica. And they gave me a skeleton of a report to be able to fill out with all the analysis and still working progress but you're welcome to check it out. I also added a summary to the issue though. So what came out of it was to find groups of the runner concepts that users think about when they're using runners and then we also had them like come up with their own terms to describe certain definitions which almost all were not aligned with what we use at get lab but conceptually you saw some connections there. They just weren't the exact same terms. And then the final exercise was to have them match the terms to definitions like the terms that we used to get lab to the definitions and most of those they did they were not able to match accurately as we define them at get lab. So there was a lot of learnings but what I'm seeing now is the next thing I want to do with that Erica suggested is work with the team to come up with names for each group of concepts and then we're going to send out another survey to like a hundred participants if we can get that many and have them select which name like they feel best describes the concepts in that group and then ask them where they're using that and they're workflow and what tasks they're using it for. So then we can figure out how we want to make changes from there like if I wanted to make the design changes for that configuration example that I shared last week that would be like a way to help us validate that that is needed. But what I'm seeing now is to have the team is very it's difficult for the team to like understand that these concepts were grouped together because it doesn't align with how runner actually works. So yeah it's people are having a hard time looking past like the technical way that it works and then how people are grouping them and I was wondering if anyone has run into that problem and kind of how you're approaching it with your team. Will do you want to ask your questions? Well I did want to give you space to see if anybody has like thoughts on the question that you just raised because by questions a little bit unrelated. Okay. I think what Emily did with environments was something similar because they challenged the existing ideas of concepts that were like that were there since forever in GitLab. So I don't know maybe Emily any insights like how did the team take take it when they learned. But this was rather something that the team was involved in. So probably that's how it was different because it was not coming from outside but from discussions within the team. So the buyer would have been on the boat somewhere. We also had a lot of research to back that our current feature wasn't working. So I think that made it easy to convince the team because through like the group of environments research additional research before we were aware like this feature wasn't really hitting the mark. So collectively I think it was much easier to move forward versus yeah it coming from someone else. Yeah which is totally different in our use case because people are very happy with runners. It almost feels like we internally because we're touching it all the time. We have a much deeper understanding of it than our users, the majority of our users I would say but also the admins or platform engineers who are managing their own runners have a very similar understanding as we do. So it's hard to get it's hard for me to be like they're not understanding it when we know that they are because people love the feature. We want to think that helped us like I know we are at a very I would say nascent stage in the entire native secrets manager concept but one thing that helped us was the competitor evaluation because like the entire team got to like take a peek into how the rest of the industry is referring to different concepts and that also helped them relate with the research data that Erica had like greater reports on. So everything together they were able to relate one thing to another and that helped in like gain that conviction. I did definitely start with that. I have like a Google Doc with competitor terminology in it but I didn't really share that widely with their group so that could be a bit places to start a person. Thank you. Yeah, I just just certainly back to my question. How did you decide to get survey data or you know target 100 people? Yeah, so Erica suggested that we run the survey for I think a month and a half I think it was or we or when we get to 100 people like whichever one comes first and I they was saying 100 because like that's the average number that they've been seeing trends lately from surveys but if you have other suggestions I am very open to it. Yeah, I've used like survey sample size calculators which I can certainly link to here. So if you know like how many people are using a particular feature because I know that we have like it a lot of internal metrics on like who's a user of this stage group or that stage group. You could use that as a little bit of a guide and to like okay if our population is x. Then we should survey this many people to get somewhat of a representative sample size but yeah I'll include one below. Okay, I think another thing was that I was kind of saying that we need to move fast with this so they probably changed them answer based on that. Okay, yeah I mean that that certainly plays a factor too. Yeah, yeah but I still would like to look at that survey sample size and see what we do. Yeah, so I added a link there. If you click into it you'll notice that it has like three different sections. You don't really have to mess with confidence interval or margin of error. You would just have to enter the population size. So that's the number that you would have to either guess to me or you know get some analytics on to populate that field. Okay, thank you. This is nice. Great, the hearing will. Yeah, so is everyone that I noticed they're still typing going on. We're good. So just a small update with the outcome of the design sprint. We're trying to figure out the best way to go forward with the research here and we've started with a just internal customer interviews with the SRA and delivery team around the service concept getting a better idea of what they consider services. How we would populate that list and after we're done those internal interviews which I think they're like six happening this week. A big thank you to Victor for scheduling them. We'll be able to move forward with like external user testing just an update on that front. The other one is I'll be working on the design issue around designing for external jobs and I believe this touches kind of like the job details page, the jobless page and the pipeline details page. I'm not sure if any of those funnel into the verified teams that have designers but if they do just let me know so I can involve you and kind of feedback for these pages. I can help because I like I took part in a lot of free searches for those pages so I can help with any feedback but otherwise there's no designer for pipeline execution. I can also help because runner has a very small portion in this but there is at least a link to the runner that runs the job and then there's a lot of output from runner in the job log that might be helpful. Yeah this is mostly just designing it around this new like external job thing and what visuals will show but I think it'll touch like all of these pages. So figuring that out as I go forward. Yeah and also please slip mean because pipeline all thering it's not just owning but we are also touching some pipeline details page and then job log as well so I'm happy to help. Thanks a lot. Have you liked can I ask a question just on like what external job means? Yeah so this is one that I'm just starting into so I have to kind of look for it that this is as far as I know a say I job that's being executed outside of get lab. Like like on actions so for example on actions okay. No worries it's so what this is is I'm reading this out is like adding a new job status so it will represent the jobs that are currently being executed by a service external to get lab. So adding in like a pending kind of state as that is being run and then yeah so I'll actually link the engineering issue here that explains it a bit more than the design issue. Um That is helpful. I'm also reading the epic and it says external jobs are not picked up by a run and so it might not even can actually mean and if so you don't have to work me in. I mean I heard about this use case in some pre-searchs and also in the conference lately but I don't know I still cannot drop a runals it I need to read through this. Yeah this is new um for 163 I just started looking into it so as I learn more I'll reach out but it's a fairly new um being more looking into so I don't have all the details right now but I'm sure over the next week I'll have more. Okay. Okay. That's it with me. Then I will take up and so I'm mostly focusing on just one thing besides a couple of our community contributions this week that's the like finishing the POC prototype so I created the user map and flow on big jam it looks so good and um based on this particular story mapping I would be like designing the different pages or the different actions for this flow and that's for this. Another thing that I wanted to share was I'm starting to add like I added a slot to my calendar from starting next week for every Thursday morning. Kind of a time that suits all of us like all the members in the CI CD team at least and this is for like to have a sync time with me to discuss just anything that relates to public presence. We can just like use this sync time to discuss a block proposal to edit a block that's already there to like write abstracts select conferences designing content representations. I mean just anything that comes to your mind if we can use this time for that and to be like how you can add yourself you can just like go to the link add it to your calendar and for a whichever week you have booked it others would not look it for that particular week. Yeah and that is it. Yeah you could just do I like I noticed it goes to a calendar block. Do you get notified or do we have to like book it with you to let you know um let's try. I don't know if that happens because when I clicked on it it just goes to a calendar event but no one's invited to it so. Yeah okay I'm also not a part of what that is amazing. Okay now I am. I'll work further on this. Does it look very full? Well some links are getting it together. Yeah are we can just like sync runes like catch up over slack and just book slots manually this doesn't work. I'm not so good with automating things. And that's it. Yeah so in the new you can take it out. No I just wanted to say plus one but yeah it's my turn okay. So I'll type it later. So things be to Kat um I have two items that I like to share that um dove and mark and myself we're planning the Q3 that what could be the CSED catalog beta and then what could be included technically and also from the user standpoint and it's almost like divine and then we also announce a true to team and then now team is some board so that's exciting that means so just to tell you a little bit of more details we will gather more and made a data from now on so that we just just don't need to hold like this depend on the repeat.mb that user right and then this is your component a and b and c like for now like we have to just let them write everything and then just hold the depend on this instruction but you like to kind of provide a better assistance and suggestion system um so this is exciting for me because it'll open the doors for the further UX opportunities that I like to share this and the other point is probably you might see this in the MR's pipeline path um there is a now failed job number is surfacing in those tabs so that was the idea for this packathon and then luckily we get a lot of positive feedback at the same time we started to get a lot of bug reports. For example there is four failed job but so we just have a zero failed job and with even with the tabo emojis like oh okay we should fix it now so we're also working on this it's just popped up but it's exciting that people had a coming in and as they and then if you also have any other feedback please please let me know I'll also link the app to your issues so that you can leave some feedback around UX and also the UI pack as well. I think this was a really good improvement like a tiny one but so impactful. Yeah I was excited and then yeah we will have more issues. Thanks um every case on leave so moved with over to Bill. Thanks, Andrew. So I just wanted to quickly touch on additional point about the survey calculator that I spoke about a couple minutes ago added some information earlier on but I would just recommend you know working with your researcher if you decide to use one of those types of tools to figure out what's the appropriate like margin of error and confidence interval because if you leave it as is that those things are more like academic standard so tell you that you need probably more than you really do so if you have like tight deadlines or you know whatever it might be you might have to adjust that a little bit to get a better sense of what's a more reasonable number of people to survey. Outside of that I'm going to be a leave starting next Monday. I'll be out for four weeks so I'll get back second half of August. I've created my Q3 prioritization issue and linked to that here. A lot of the stuff that's represented there is just carry over from this quarter that's still active and then I'm going to be picking up some projects that are paused. And then since Ali has departed get labbed, coordinating with the PM Lauren and then Hianna to determine next steps for the solution validation project they was leading. So we're meeting on Thursday to discuss this more in sync haul but we're also having a synch discussions about it. If Hianna's going to be able to drive it while I'm out if we're going to just kind of keep it paused for the next couple of weeks until I'm back those sort of things. So that's what's going on with me right now. Enjoy your family time. Yeah. Yeah I need it. Yeah my wife goes back to work next week for the first time in like 12 weeks. So I'm going to be on full-dad duty 247. So give it them a little bit of a break. Okay so with that we have at the end of the agenda anything that anyone wants to bring up. If not then let's play more time back. Yeah let's meet later. Fine.",
  "The GitLab Legal Commercial team is responsible for all contracting matters at GitLab. This includes, procurement, revenue, channel, technical and alliances. The Commercial Team partners with sales, technical, and business stakeholders to ensure the alignment with GitLab contracting standards, as well as the most efficient timeline to reach execution.",
  "Please note that all links are GitLab-internal only.",
  "Employment law governs the relationship between employers and employees. At GitLab, the Legal Employment team serves as a strategic partner across the organization, providing expert guidance and proactive legal solutions throughout the entire team member lifecycle. What does this partnership entail? We * collaborate strategically with Sales, Go-to-Market, Finance and People teams to develop scalable, compliant employment solutions as GitLab expands globally and responsibly, implementing a comprehensive process for gathering, assessing, and acting on country-specific information. We empower the Talent Acquisition department to achieve its critical goals while ensuring compliance with local laws and regulations during sourcing, recruitment, and hiring processes. We enable the People Operations team to effectively onboard and support team members with location- and role-specific legal support, setting team members up for success from day one. We partner with the Total Rewards team, People Operations team and People Business Partners to develop forward-thinking policies that balance GitLabs business objectives, team members needs, and global legal requirements. We provide strategic counsel to our Team Member Relations team, People Business Partners, and Total Rewards as they navigate complex team member matters, including reasonable accommodation requests, performance management, career progression, and other relationship dynamics. We champion our Diversity, Inclusion, and Belonging initiatives by aligning all employment decisions with our mission statement and applicable laws. We safeguard GitLabs interests while also providing fair treatment during employment transitions, including offboarding processes and post-employment matters. To work with the Legal Employment team, reach out early in your process, provide complete information about your needs and any time constraints you have. Being specific about what youre requesting and any deadlines you face will enable the Legal Employment team to best triage requests and support you. To connect with Legal Employment, especially on sensitive matters, you can use the  legal-employment@gitlab.com  email address, or for non-sensitive queries, you can reach out in the #legal slack channel. Note that GitLab team members with individual employment queries should reach out to Team Member Relations team on  teammemberrelations@gitlab.com  or to their aligned People Business Partner for support. For cross-functional projects that do not involve individual team members but do require the Legal Employment teams attention, please (i) open an Issue in the Legal and Compliance Project ; (ii) select the appropriate Issue Template; (iii) apply the label legal-employment :: to-do and (iv) if you know which Legal team member you will be working with, include them as an Assignee. This will update the Legal Employment Issue Board for the Employment teams benefit, and allow the team to pick up and/or assign appropriately. A table showing coverage for queries by subject matter is available for internal use and can be accessed here . You are welcome to consult any member of the Legal Employment team. It is worth considering the privilege guidelines when communicating with GitLabs Legal and Corporate Affairs team (aka the LACA team), including the Legal Employment team. Note that, if a communication is privileged, it can be protected from disclosure in litigation or other disputes. If in doubt, theres an internal, GitLab University micro course on Privileged communication , which is relevant to any team member who communicates with the LACA team, seeking legal advice on behalf of GitLab. The training explains the legal protection which may be applied to certain communications between team members and LACA and how best to communicate in order to be protected. It is also important to note that, if you receive any formal documents that appear to be legal notices, demands, subpoenas, court papers, or other potential litigation materials, you should please forward these by email to the legal team immediately (to the  legal@gitlab.com  email address) without responding yourself. Please add a brief note explaining when and how you received the document. These materials often have strict response deadlines, and your prompt sharing allows the legal team to review and address them properly to protect both you and GitLab.",
  "Corporate Sustainability is a business approach that enhances long term stakeholder value by implementing a strategy that considers every dimension of how a business operates when making social, environmental and economic progress. ESG stands for Environmental, Social and Governance and refers to the three key factors when measuring the sustainability and ethical impact of an investment in a business or company. At GitLab we use Sustainability and ESG interchangeably. Both terms are relevant to our work and both serve different purposes depending on the audience we interact with. The Sustainability Team creates and maintains GitLabs Corporate Sustainability strategy and programs by driving and integrating responsible business practices and ESG regulatory compliance. The Sustainability team builds and maintains strong internal and external relationships to understand stakeholder expectations - including customer, investor and team members. This engagement allows us to remain customer centric and easy to do business with while meeting shareholder and team member expectations. The Sustainability Team has two primary functions and four corresponding programs: Compliance & Reporting : Manages customer and prospect ESG-related questionnaires, requests for proposals, and sustainability contractual clauses. Leads annual Sustainability report and external assurance process. Monitors global ESG regulation and works cross-functionally to advance GitLabs culture of compliance with applicable ESG regulations. Responds to investor ESG rating agencies to maintain competitive ESG scoring among peers. Climate Action : Identifies and executes strategic climate programs, including annual measurement of GitLabs greenhouse gas inventory, emissions reduction target-setting, partners with Procurement to run the sustainable supplier program, identifies emissions reduction opportunities across the business, and purchases high quality carbon credits. Manages team member & customer communications related to GitLabs commitment to environmental sustainability. GiveLab : GiveLab is GitLabs team member volunteer program and includes year-round volunteering, GiveLab 30 days of Impact, our annual company-wide volunteer campaign and GiveLab Champions Program. Volunteerism is an effective way to build trust through social connections - this leads to higher individual and team motivation, and greater cross-functional collaboration. GitLab for Non-Profits : GitLabs in-kind donation program. Manages social impact communications with team members and customers, while developing strategic nonprofit partnerships to advance GitLabs ESG goals and help enhance our brand reputation by demonstrating our commitment to the nonprofit community. Deeply integrated into our business philosophy, GitLabs Sustainability strategy is driven by our values of Collaboration, Results for Customers, Efficiency, Diversity, Inclusion and Belonging, Iteration, and Transparency (CREDIT). GitLabs stakeholders, including customers, investors, team members, and community members play a key role in GitLabs Sustainability strategy. GitLab conducted its inaugural ESG materiality assessment in 2022. By conducting a materiality assessment with our stakeholders, we identified which ESG topics have the greatest impact on GitLabs business and where we have the potential to have the greatest impact on the environment, society, and our global communities - those material topics drive the programs, policies and initiatives under our strategy. This page will continue to be updated as we make progress towards developing plans and programs to advance our Sustainability goals. The purpose of the advisory committee is to create cross-functional alignment on ESG objectives and decision making, to go beyond simply compliance and into long-term operational implementation. Members of the Sustainability Advisory Committee Like all functions at GitLab, transparency is a core focus. Every year GitLab publishes an annual sustainability report where we share our approach to managing our key sustainability focus areas, provide updates on programs and policies, achievements to date, metrics and targets, and plans for the future. The Sustainability team works cross-functionally to prepare GitLab for compliance with ESG regulations. The Sustainability team also supports internal teams with customer ESG questionnaires and RFPs. Customers and prospective customers are increasingly asking about GitLabs Sustainability programs, including questions related to GitLabs climate commitments and greenhouse gas emissions. Many of our customers are also subject to ESG regulation and we expect customer ESG questions to continue to increase as they look to better align to new regulations. GitLab is committed to doing our part to minimize our environmental footprint, including working to reduce greenhouse gas (GHG) emissions associated with our operations. GitLabs stakeholders, including customers, investors, regulators, and team members expect the company to operate sustainably and to do our part to reduce our environmental footprint. Many of GitLabs customers have GHG reduction targets and as a vendor, GitLabs carbon emissions contribute to our customers emissions footprints. To remain easy to transact with, GitLab needs to meet the expectations of our customers by taking action on climate change. GitLabs Climate Action Program consists of four pillars: Measure & Report: Every year GitLab conducts an annual greenhouse gas (GHG) inventory in alignment with the GHG Protocol, the global best practice carbon accounting standard. We publish the results of the inventory in our annual ESG report and have the data assured by a third-party. In 2026, GitLab is subject to new regulations in the US and the EU that will make these disclosures mandatory. Act: GitLab is taking action to reduce our carbon emissions. As a fully remote software company, the majority of our emissions come from our suppliers. Engaging our suppliers to measure their carbon emissions and set their own reduction targets is a critical component of our reduction pathway, which is why we have set an aspirational supplier engagement target. Please see the Sustainable Procurement Program for more information. The Sustainability team continues to explore other ways to reduce emissions and is doing further analysis on additional reduction pathways. Engage: This includes engaging GitLab team members in climate education and action. In 2024, we launched the GitLab Team Member Sustainability Guide , providing actionable steps team members can take at home to minimize their environmental impact. In FY26, we launched our partnership with Mammoth Climate , a climate literacy and challenges platform, to further engage team members with educational materials, activities, and rewards Accelerate: While GitLab works to reduce our emissions, we are also committed to accelerating climate solutions by purchasing high quality carbon credits to cover a portion of our carbon footprint. We are proud to partner with Rubicon Carbon to purchase a diversified portfolio of high quality carbon credits, financing carbon removal projects that meet Rubicons high standards of quality . In FY25, GitLab set an aspirational science-aligned supplier engagement target to reduce our Scope 3 emissions: 70% of our suppliers (by emissions) will have science-aligned climate targets by FY29. Our sustainable procurement program includes the following initiatives: We look forward to sharing updates on this new initiative. The Green DevOps Working Group at GitLab aims to embed sustainability throughout the software development lifecycle to reduce environmental impact while unlocking operational and business value. Its core objectives include lowering carbon emissions and energy use, integrating green practices into business processes, enhancing customer capabilities to meet regulatory and sustainability goals, and positioning GitLab as a leader in sustainable DevOps and green software. Workstreams address areas such as cloud sustainability, CI/CD energy consumption tracking and reduction, community innovation and engagement, sustainable AI and procurement, and reporting. Each workstream is led by the Sustainability team and the relevant functional team member. Customers who are interested in providing insights and feedback on sustainability features are encouraged to contact the Sustainability Team at esg@gitlab.com for more information. At GitLab, all team members do work that supports the company, which supports the enhancement of an open source codebase. This codebase is freely available to everyone to make better software faster and drive progress through what they build. Between 2022 and 2024, team members made over 125,000 commits to the open source part of the GitLab codebase. But, there are also other ways to give back and many team members choose to contribute beyond GitLab. In addition to contributing to GitLab, GitLab offers additional optional pathways for team members to give back while leveraging their unique skills and passions through programs such as GiveLab, GitLabs Team Member Volunteer Program. GitLab encourages team members to take part in volunteer initiatives such as supporting their local communities, participating in virtual volunteer activities, and organizing volunteer activities as part of team events. Corporate volunteerism has been proven to be an effective strategy for boosting engagement , improving employee retention, and strengthening relationships at work . Volunteering with GiveLab supports team members in fostering connections, building trust among one another and embodying our CREDIT values while positively impacting our communities. Team members may self organize volunteer events at any point throughout the year. To submit a request for a team volunteer activity with a Registered Nonprofit Organization that isnt on the current GiveLab Nonprofit Directory , please go to the Philanthropic Requests epic and open a new issue using the Volunteer_Support Template . Team members can also request support from the Sustainability Team to organize local or virtual volunteer opportunities on their behalf by going to the Philanthropic Requests epic and opening a new issue using the Volunteer_Support Template . Please write yes for the question, Would you like the Sustainability teams help organizing the volunteer activity? All team members and volunteer activities must adhere to the GitLab Philanthropy Policy . Team members must follow GitLabs paid time off (PTO) policy if volunteering during work hours and use the public service/volunteer option in Workday. If volunteering in person, team members may incur some expenses. Team members can expense up to a total of $25 per volunteer event for expenses incurred that meet the allowed for reimbursement criteria. All expenses should be submitted in Navan using the GiveLab classification. Please note that GitLab does not allow team members to travel to in-person volunteer events. All in-person volunteering should be local to the team member. As with all company expenses , team members must be thoughtful in spending the companys money and use best judgment to ensure that all expenses are deemed ordinary and necessary. Team members should follow all team member expense responsibilities . Expenses allowed for reimbursement (for in-person volunteer events): Expenses not allowed for reimbursement: As with our unique ways of working, GitLab and its team members have identified and sought out opportunities for impact that speak not only to our values but also to our all-remote nature. To review previous opportunities that team members participated in, visit the historical activities page . GiveLab 30 Days of Impact is GitLabs annual volunteer campaign created to encourage team members to foster connections, build trust among one another and embody our CREDIT values while positively impacting our communities. We have designed this program with our high-performing team culture and results for customers in mind. GiveLab 30 days of Impact runs annually in Q4 and our goal is to encourage as many team members as possible to volunteer over the course of 30 days. Throughout the month, team members can volunteer as little as one hour of their time to make an impact. We understand that our team members are driven by many different factors, and we welcome that volunteer participation will look different for everyone. Through GiveLab 30 days of Impact we aim to offer many different ways for team members to get involved such as: While GitLab encourages year-round volunteerism through GiveLab , GiveLab 30 days of Impact centralizes our efforts into an annual campaign to have a larger collective impact over a specific timeframe. Corporate volunteerism has been proven to be an effective strategy for boosting engagement , improving employee retention, and strengthening relationships at work . Additionally, this program offers volunteering opportunities around a major holiday season in many parts of the world, a time when many are seeking opportunities to give back. Team member participation is voluntary, should not interfere with work commitments, and time off is required to be in alignment with GitLabs PTO policy . Travel is not permitted for this program. Team Members may choose to volunteer virtually or through local in-person events. Volunteer events typically last between one and four hours. Managers play an important role in supporting team members in taking time for themselves and their families, while also ensuring accountability to results and coverage for teams and its goals. Our Results for Customers value sits at the top of our values hierarchy, and our PTO policy empowers managers to appropriately manage workloads and deliverables, while also giving team members the time away they need from work. Team Members taking time off to volunteer should communicate time off in advance with their manager. To request volunteer time off, follow the Paid Time Off procedures outlined in our handbook and reach out to People Operations via HelpLab should you have any concerns. A step-by-step guide on how to request paid time off can be found here . Note that volunteer time off should be used towards acceptable volunteer activities and in adherence with our GitLab Philanthropy Policy . Please see our GiveLab reimbursement policy to understand current allowances as they relate to volunteering costs. We have created an internal GiveLab Volunteer Directory that features a list of vetted nonprofit organizations with available volunteer opportunities. Team members can search the document for virtual volunteer opportunities, opportunities to volunteer with GitLab Foundation grantees and search for local opportunities. We encourage all team members to contribute to our GiveLab Volunteer Directory. To recommend a nonprofit organization to add to the Directory, please open a Volunteer Recommendation Issue . The GiveLab Champions are team members who are passionate about giving back to their communities and want to encourage other team members to do the same. GiveLab Champions self-identify to participate in the voluntary Champions group, managed by the Sustainability team. The GiveLab Champions help activate the GiveLab signature program, but also work to organize and promote volunteer opportunities year-round. GiveLab Champions help team members build trust through social connections, build connections within their communities, and help GitLab provide meaningful opportunities for team members to give back. The GiveLab Champions ensure global voices are heard and relevant causes are represented based on where team members live. GiveLab Champions help to make GitLab a better place to work. The time commitment for a GiveLab Champion is estimated to be 3-5 hours per quarter. Participation can vary throughout the year. GitLab launched GitLab for Nonprofits , an in-kind donation program in 2023. Through this program, GitLab supports Registered 501c3 (or jurisdictional equivalent) Nonprofit Organizations in good standing that align with our values by offering free licenses and seats. The program operates on a first come first served basis. Once the annual donation of 5,000 seats is met, the application will remain closed for the year. What are the benefits of the GitLab for Nonprofits program? GitLab is a single platform for project management, collaboration, source control management, git, automation, security, and much more. Because it is easy to use, flexible, and all in one place, it is the best choice for nonprofits to scale their work. The GitLab for Nonprofits Program gives free licenses of GitLab to registered nonprofit organizations. Nonprofits accepted into the program will be provided a free Ultimate license for one year (SaaS or self-managed) for up to 20 seats. Additional seats may be requested although they may not be granted. Who qualifies for the program? GitLab supports Registered 501c3 (or jurisdictional equivalent) Nonprofit Organizations in good standing that align with our Values . A Registered Nonprofit Organization is one that has been registered with the local government or authorized agency within its applicable local, state, provincial, federal or national government. For the calendar year 2024, we will limit the in-kind program to 5,000 seats, which was approved by finance and the board in the Philanthropy Policy . Each organization will be eligible for up to 20 seats. This will allow us to assist as many organizations as possible. This will be revisited throughout the year and adjusted as needed. Interested organizations who are new customers may request additional seats although the request may not be granted. To limit churn, current GitLab customers that apply to transition to the Nonprofit Program will not be granted a special request above the 20 seats. What are the terms of the GitLab for Nonprofits program? Upon acceptance, program members are subject to the GitLab Subscription Agreement . The decision to issue a GitLab for Nonprofits license is always at the sole discretion of GitLab. Interested organizations need to visit the GitLab for Nonprofits page and submit the application form . How are applications processed? Nonprofits apply on the GitLab for Nonprofits page. Once the application is submitted, the Nonprofit will receive a message and a link to TechSoup, our verification partner. The Nonprofit will then need to log in or create their TechSoup account. TechSoup provides a rigorous vetting process to ensure the nonprofit is eligible for the GitLab for Nonprofits program and meets all requirements. If a Nonprofit is verified, TechSoup will notify GitLab. GitLab will then undergo its own vetting and approval process. Once all parties have verified and approved the Nonprofit, GitLab will send the instructions directly to the Nonprofit to redeem their license. If a Nonprofit is not verified through TechSoup, TechSoup will provide details on how the Nonprofit can become verified. If a Nonprofit is declined from GitLab, GitLab will notify the Nonprofit via nonprofits@GitLab.com . Please allow up to 15 business days for the application and verification process. Must Nonprofits renew their memberships? Yes. All nonprofits must renew their membership annually, which involves a re-verification process. Nonprofits will submit for renewal the same way they first applied for the program. Where can members receive support? While GitLab for Nonprofits Program benefits do not include product support , program members can receive help with GitLab in a number of ways. In general, we recommend the following: Im a GitLab Team Member and I have a customer applying for the program. What do I do? Information on how GitLab Inc. supports Registered Nonprofit Organizations can be found in the Philanthropy Policy . Please note that for all Philanthropic Requests, including requests for GitLab to join as a member to an association, program or organization, approval by the Sustainability team and CLO is required as defined by the Oversight Responsibility section of the Policy. If you would like to submit a philanthropic request, please follow the instructions based on your request type. There are two ways that team members can submit a request for monetary support: Request funding from the Sustainability team to support a Registered Nonprofit Organization OR (not currently accepting applications - see instructions below on submitting a non-profit for future consideration) Request utilizing department or TMRG budget to support a Registered Nonprofit Organization If you are requesting funding from the Sustainability team to support a Registered Nonprofit Organization, please note that at this time, we are not accepting applications. If you would like to submit a Nonprofit Organization to be considered for support in the future, please go to the Philanthropic Requests epic and open a new issue using the Monetary_Support Template . You will be notified if there is a future opportunity. If you have a department or TMRG budget that you would like to utilize to support a Registered Nonprofit Organization, please go to the Philanthropic Requests epic and open a new issue using the Monetary_Support Template . Please tag your manager to approve the request if you are submitting on behalf of your department. If you are submitting a request on behalf of a TMRG or DIB, please add the DIB DRI as a reviewer. Please allow a minimum of 10 working days for review. The team member submitting the issue is responsible for obtaining proper approvals and working with Accounts Payable to issue the payment. Please tag the individuals in the approver section of the issue. Once approvals are completed, the team member requesting the donation needs to obtain an invoice from the non-profit that contains the bank payment details and submit this to AP@GitLab.com . For requests related to GitLab Membership of Association, Program or Organization, and includes terms, conditions and/or obligations on GitLab that must be executed, please follow the below process. Open an issue using the Membership Request Issue Template . Complete and attach the necessary information. Note: If you are submitting a request on behalf of a TMRG or DIB, please add the DIB DRI as a reviewer. NOTE: For any request(s) that require payment, please be certain to follow applicable ESG & Procurement processes. At this time, GitLab does not offer a matching gifts program.",
  "The Strategy & Legal Ops team promotes and institutes streamlined processes, efficient tools, and centralized program management to ensure LACA remains agile and able to support every area of GitLabs business. Check out our issue board to learn more about what were working on. GitLab uses Brightflags Legal Spend Management platform to process and review legal invoices and accruals. See the Brightflag invoicing process in the internal handbook. Accruals submission reminder notifications are automatically sent through Brightflag to ensure vendors submit their accruals on time. This process is designed to enable LACA team members to submit requests related to attending events/conferences, furthering development, or purchasing tools/software funded by LACA. This process does not apply to equipment , Individual Use Software or other personal reimbursement requests.",
  "The Privacy Team is part of the Legal and Corporate Affairs Team. We provide support and guidance to uphold consistent business processes around the protection of personal data as it relates to GitLab customers, users, Team Members, and other natural persons. We collaborate cross-functionally and serve as advocates to ensure that the data privacy practices of GitLab meet the needs of our cross-functional partners and are continually balanced with an ever-changing global data privacy and protection landscape. Slack channel - #legal is the best place for questions relating to our team that do not require legal advice, deliverables, or any discussion of confidential information. For issues that require action from the Privacy Team, apply the label Privacy::Intake . This will update the Privacy Legal Issue Board and allow the team to triage the issue appropriately. We also use the following labels: For sensitive, private, or confidential requests email legal_internal@gitlab.com . Please do not send emails to this address for engineering, marketing, sales or procurement requests. These should be directed to #legal or an issue should be created in the Legal and Compliance project. Tell people what you are doing with personal data and why you are doing it so that the person can make an informed decision about whether they want to allow it to happen. Do not be creepy about what personal data is collected or how it is used and do not change the way personal data is used without first giving people notice and an opportunity to object, or, where required, obtaining prior consent. Make it easy for people to tell us their privacy preferences and honor those preferences even if they change over time. Build a product or service that has privacy-focused settings turned on by default and let the consumer decide if and when they want to change that. Transparency is a core value and every team member is responsible for the proper collection and use of personal data consistent with our Privacy Statement . Anonymization The process of permanently and irreversibly altering personal data in a way that it is no longer capable of being related back to a specific individual. Consent A freely given, specific, informed and unambiguous indication of an individuals wishes. Consent is captured by an un-ticked checkbox or other unequivocal statement which signifies agreement to the processing of personal data before or at the time of collection. Data Classification A method of determining types of data associated by risk. See GitLab Security Data Classification Standards for more information. Data Controller A natural or legal person, agency, or other entity which alone, or jointly with others, determines the purpose and means of processing personal data. For example, GitLab is a Data Controller is in the areas of marketing and sales where the personal data of prospects and leads is managed solely at our discretion. GitLab also serves as a Data Controller for all personal data collected from Team Members for employment purposes and any administration of benefits. Data Processor A natural or legal person, agency, or other entity which processes personal data on behalf of a Data Controller. GitLab acts as a Data Processor when we manage personal data native to a Customers instance or namespace. GitLab acts as a Processor in these situations because the Customer is the ultimate owner of the data it submits to the service offerings, and our contracts service as Customers instructions to GitLab regarding the processing of their data. Data Subject An identified or identifiable natural person. Data Subject Rights Rights granted to individuals in relation to personal data or information processed about them. Because Data Subjct Rights are instrumental to the privacy and protection of data subjects, many of these rights are codified under global privacy legislation, such as the GDPR, CCPA, and LGDP. If a business processes personal data pursuant to certain bases such as consent or legitimate interest, then a data subject may assert one of its fundamental rights and a business is obligated to respond under law. The rights granted vary slightly by country, region, province or state. GitLab treats all users and Team Members the same and will respond to a data subject request from any individual user or team member even if they live in a country, region, or state/province without specific data protection laws. Expand the following section for more information about the data subject rights available. Right of Access A request seeking access to the specific pieces of personal data that have been collected and used by a Data Controller. Right to Correct A request asking for inaccurate or incomplete personal data to be corrected. Right to Delete A request which seeks the erasure of personal data relating to the data subject. Deletion requests must meet certain conditions and businesses are not required to delete any personal data that is processed to meet legal obligations, including that data which may be processed in pursuit or in defense of claims. Right to Portability A request where the data subject wants to transfer their data to another Data Controller; typically seen when the individual changes service providers that share a compatible electronic filing system. Right to Restrict Processing This is a request for the Data Controller to stop processing personal data under certain circumstances. This may also include a request to limit the use and disclosure of Sensitive Personal Data. Right to Object A request to opt-out of all data processing or specific processing of personal data based on consent or legitimate interest. Generally this is a request to opt-out of processing for targeted advertising, which includes the sale or sharing of personal data for profiling or cross-context behavioral advertising. Right Not to be Subject to Fully Automated Decisions This is a request that the data subject not be subjected to a decision based solely on automated processing, including profiling, which would have a significant legal impact. An example might be an algorithm that excludes someone of a certain race from obtaining a credit card. DPIA A Data Protection Impact Assessment is a method to review and document identified privacy compliance risks, as well as evalute higher risks to the rights and freedoms of individuals, including any that pose potential for significant harm. Learn more about GitLabs process for completing DPIAs here . Personal Data Any data, individually or when combined with other data, that identifies, relates to, describes or is reasonably capable of being associated with or linked to an identifiable natural person (a data subject), whether directly or indirectly. See also, Sensitive Personal Data. Privacy by Default A concept that should be implemented at the product development stage and uses appropriate measures to ensure that, by default, the only personal data processed is what is truly necessary. In practice, this means a users privacy settings prioritize privacy in their default state. Privacy by Design A concept which focuses on intentionally designing a product that incorporates foundational privacy principles and ensures that Controllers and Processors are able to fulfill data protection obligations. This may include appropriate technical and organizational measures such as pseudonymisation and encryption. Pseudonymization The process of altering personal data so that it can no longer be attributed to a specific individual without the use of additional re-identifying information. In order to practice successful Pseudonymization, the re-identifying information should be kept separate from the pseudonymized data. Publicly Available Personal Data Refers to personal data that is publicly available from federal, state, or local government records or made manifestly public by the data subject. Under limited data privacy laws this may also include personal data made public through widely distributed media. Sensitive Personal Data Data that is particularly personal and intimately tied to the core identity of a person. This type of data generally includes racial or ethnic origin, political opinions, religious or philosophical beliefs, trade union membership, genetic data, biometric data, data related to health, data related to sex life or sexual orientation, criminal offenses, and citizenship/immigraion status. In some jurisdictions, Sensitive Personal Data includes government identifiers and financial data. Every vendor that handles personal data is required to go through a Privacy Review prior to being onboarded, which includes completion and approval of the privacy due diligence questionnaires detailed in the Procurement process . Certain vendors who are classified as handling red or orange data under our Data Classification Standards are reviewed annually. Additionally, when new product features are designed, there are times when a formal privacy review is required. This section outlines the process for these reviews. For Third-Party Risk Acceptance, any Moderate/High risk requires VP and/or above approval Anytime a new feature or a change to an existing feature is planned, Product Managers and Engineering Managers should evaluate if the planned development presents a legal risk where personal data is involved. If Personal Data is implicated, utilize the Legal Risk Checklist and Workflow ( internal only ) GitLab Team Members are required to complete annual training which covers general privacy practices worldwide. The goal of annual training is to ensure that Team Members understand what personal data is and how to handle it to ensure that GitLab maintains the trust our customers have placed in us as well as to ensure that GitLab remains compliant with frequently changing legal and regulatory obligations.",
  "The guidance for using open source software has been updated to enable team members to comprehensively determine which open source license types are pre-approved (deemed acceptable) for use, and which require prior review by the Legal & Corporate Affairs team (as their use may be unacceptable). Team members wishing to use open source software should now refer to the comprehensive Blue Oak Council license list, and proceed, as follows: Team members must ensure that we comply with all requirements and restrictions associated with the applicable license (these are typically defined in the body text of the license). If youre contributing to an open source project on behalf of GitLab, you may be required to enter into a CLA. In accordance with the Authorization Matrix Policy , legal approval is required to you enter into a CLA on behalf of GitLab. If you have the choice between a Corporate and Individual CLAs, opt for the Corporate CLA. Follow these steps to obtain legal approval and enter into a CLA on behalf of GitLab: Contributions to a third-party project on behalf of GitLab should be made using your @gitlab.com email address. Post any questions to the #legal Slack channel. Alternatively, if looking for information on contributing to GitLab see here . GitLab has established guidance to aid with determining authorship of academic papers developed at GitLab. This guidance is accessible to team members only here The purpose behind this initiative is to ensure consistent and fair licensing enforcement for breaches of certain licensing terms, in order to support the continued growth of the open source community. Further information on this initiative is available here . GitLabs GPL Cooperation Commitment follows: Before filing or continuing to prosecute any legal proceeding or claim (other than a Defensive Action) arising from termination of a Covered License, GitLab commits to extend to the person or entity (you) accused of violating the Covered License the following provisions regarding cure and reinstatement, taken from GPL version 3. As used here, the term this License refers to the specific Covered License being enforced. However, if you cease all violation of this License, then your license from a particular copyright holder is reinstated (a) provisionally, unless and until the copyright holder explicitly and finally terminates your license, and (b) permanently, if the copyright holder fails to notify you of the violation by some reasonable means prior to 60 days after the cessation. Moreover, your license from a particular copyright holder is reinstated permanently if the copyright holder notifies you of the violation by some reasonable means, this is the first time you have received notice of violation of this License (for any work) from that copyright holder, and you cure the violation prior to 30 days after your receipt of the notice. GitLab intends this Commitment to be irrevocable, and binding and enforceable against GitLab and assignees of or successors to GitLabs copyrights. GitLab may modify this Commitment by publishing a new edition on this page or a successor location. Covered License means the GNU General Public License, version 2 (GPLv2), the GNU Lesser General Public License, version 2.1 (LGPLv2.1), or the GNU Library General Public License, version 2 (LGPLv2), all as published by the Free Software Foundation. Defensive Action means a legal proceeding or claim that GitLab brings against you in response to a prior proceeding or claim initiated by you or your affiliate. GitLab means GitLab Inc. and its affiliates and subsidiaries.",
  "The Risk Management and Dispute Resolution (RMDR) division of GitLab Legal and Corporate Affairs (LACA) is responsible for informing and guiding GitLabs risk management strategies as well as managing internal and external investigations, litigation and other dispute resolution. We seek to support resolution across a wide range of topics, including responding to subpoenas and discovery requests, drafting and revising legal documentation, managing investigations and negotiating and drafting agreements. It is our goal to proactively address and resolve these matters in support of GitLabs business objectives, coordinating with internal business partners across the company whenever appropriate. In support of these goals, we adopt this mantra: if you see something, say something! There are times when GitLab team members must immediately consult with RMDR to ensure that GitLab is managing its legal risks effectively. These include: If in doubt, please involve RMDR earlier rather than later  we would always rather be proactive than reactive. You can reach out to RMDR via rmdr@gitlab.com . Privileged communication is communication, written or oral, that is protected from later disclosure in litigation because it was conveyed to the attorney in confidence by a client for the purpose of seeking legal advice or by an attorney for the purpose of giving legal advice . Privilege can also be asserted over certain confidential documents created by attorneys for the same purpose. The terminology differs depending on the jurisdiction. For example, in the United States, the privilege is generally referred to as attorney-client privilege for communications made to or from an attorney for the purpose of providing legal advice or attorney work product for communication or documentations created in relation to actual or anticipated litigation. In many of our EMEA and APAC countries, it may be called client legal privilege, legal professional privilege, legal advice privilege, or litigation privilege. Additionally, the scope of the privilege differs by country. It is therefore likely that the status of a privileged communication that contains legal advice in respect of foreign law will be determined by reference to the law of the country in which any action is taken. If you have jurisdiction-specific questions about privilege, please contact a LACA team member who sits in that jurisdiction. Practically speaking, this means that communications between our team members and members of LACA are not necessarily privileged just because a member of the LACA team is involved. As a threshold matter, the LACA team consists of both attorneys and non-attorneys. Communications may be privileged if the person wishing to assert the privilege can establish that the communication was made to an attorney of the LACA team and the dominant purpose of the communication was to seek legal advice. Conversely, if the dominant purpose of the communication - even if made to an attorney - is simply to seek business advice, it is very unlikely to be privileged. Additionally, otherwise privileged communication will lose its privilege in most circumstances if it is further or also disclosed to third parties. Thus, team members should always be aware of who has access to the communication and should be very careful about forwarding it. What are some tips for team members to follow to help maintain privileged communication? Below are the steps you can take to help ensure that any communications you have with GitLabs LACA team can be considered privileged: For more information, please see the internal handbook here . A legal hold is the process GitLab uses to preserve all forms of relevant evidence, whether it be emails, instant messages, physical documents, handwritten or typed notes, voicemails, raw data, backup tapes, and any other type of information that could be relevant to an investigation, pending or imminent litigation or when litigation is reasonably anticipated. Legal holds are imperative in preventing spoliation (destruction, deletion, or alteration) of evidence which can have a severely negative impact on a companys case, including leading to sanctions. Once GitLab becomes aware of an investigation or potential litigation, a GitLab attorney will provide notice to the impacted team members, instructing them not to delete or destroy any information relating to the subject matter of the investigation or potential litigation. The legal hold applies to paper and electronic documents. During a legal hold, all retention policies must be overridden. Your obligation to follow the procedures outlined in the notice continues until the hold is lifted, even if you depart the Company. If you depart the Company, all Company owned devices and any material you are holding in accordance with any active Legal Hold Notice or active Company investigation should be turned over upon your departure.",
  "Trade control laws, which often consist of sanctions, export controls, and import laws, govern how and under what circumstances technology, software, and technical assistance may be exported. Trade control laws vary from country to country but usually exist to protect national security and further foreign policy and economic interests. Under United States law, exports, re-exports, and transfers, can take many forms, including oral, written, and visual disclosure, physical shipment, and electronic transfer or transmission. An export can also occur when technology, software, or technical assistance is transmitted to U.S. nationals abroad, or to non-U.S. nationals located within the United States. The export of certain software, technology, or technical assistance to certain countries, certain end users, or for certain end uses, may require authorization from the United States government prior to export, re-export, or transfer. GitLab Enterprise Edition, related technology, and services (collectively, GitLab Software), are subject to the Export Administration Regulations (EAR), administered by the U.S. Department of Commerce, Bureau of Industry and Security (BIS), and various sanctions programs administered by the U.S Treasury Departments Office of Foreign Assets Control (OFAC). The GitLab Community Edition is freely available to the public and is not subject to the EAR. GitLab continuosly monitors developments to these regulations to maintain compliance and to leverage any opportunity to broaden access to GitLab in a compliant manner that allows everyone to contribute. The GitLab Software has been classified via CCATS G178430 as a 5D992.c mass market encryption product with eligibility for export to most destinations under 15 CFR 740.17(b)(1) of license exception ENC. GitLab users may not export, re-export, or transfer GitLab Software, without first obtaining authorization from the U.S. government, to (a) any U.S. embargoed country including but not limited to Cuba, Iran, North Korea, Syria, Russia, Belarus, and the Crimea, Donetsk, and Luhansk regions of Ukraine, (b) any party identified on OFACs Specially Designated Nationals and Blocked Person list or the Department of Commerce Denied Persons, Entity, or Unverified lists, or (c) for end use involving sensitive nuclear, rocket systems, unmanned aerial vehicles, missiles, chemical or biological weapons, or for any other end use prohibited by 15 CFR 744. GitLab provides this information, which is subject to change without notice, to facilitate GitLab users compliance with applicable trade control law. GitLab users remain solely responsible for exporting, re-exporting, and transferring GitLab Software and any user-developed content in accordance with those regulations and should seek legal counsel as necessary.",
  "Okay, I have you one. Is this YCD wax, um, me T, 2024, January 17. Um, let's see, I'm going to start from the top. I actually have to move my plate to the bottom. Yes, that's a question for here. Um, and I think, yeah, we start with the, so we do not go out, you know, thank you. Thank you. I have a few updates. One is that I'm almost done with the competitive evaluation for fleet visibility and I did link the issue, which has the FIG jam file in it. Um, it is actually very, I hopeening to see what the other products are doing. I won't mention their names, but if you're interested, take a look or just wait for me to post the summary. It's probably gonna be faster if you just wait. And then a couple of things that are coming up. I wanted to get some eyes on to see if anyone has worked on something similar. One of them is that for the fleet dashboard, we're going to be adding a filter to filter by tags. And it's going to be a global filter for the dashboard. So it will filter all panels in that dashboard. Um, if anybody has worked on something similar, I just, I would appreciate your feedback on the placement of the filter there. And if it's clear. And then the other issue is a CSV export for time period. So we have, and the fleet dashboard, one of the panels is allows you to export the usage information as a CSV report. And then from there, people usually take that and like create internal dashboard or filter using whatever other tool that they're excelled or something like that. And now we want to allow them to choose the time period rather than it just by default being previous month. So I'm going to be working on that in this coming milestone. And that's more of just sharing for awareness. Yeah. If there's a good. Now I'm going to talk about the the filter while the filter placement. I'm trying to find the information in my brain, but I think when when we work on. Was it an environment dashboard was. Yes, environment dashboard. I think so. It's just that too many features. I think it's better if I just write down because I need to put an information in my brain. But I do have some feedback about this and also just some. Social validation that was done before. My question here is you have the the filter. That drop down component. Yeah. So you're thinking the future you're going to have more you know elements there and you why if that user can interact with. If we do it would only be one more and it would be. It was time you could filter by some type of time period. Those would be the only two that would be able to impact every single. Data point on the dashboard. But have you played around heavy instruments and with the that filter bar right the search bar where you have like the tokens and chips. Like what we have in merge requests the issues view. And if so why was the drop down. The option that you. Sorry everybody it's like dinner time. I've been to the computer for too many hours and like I'm like. I'm going to need to find out. But anyways, why what this instead of the Mr. Bar. Yeah, so we use the filter bar on the runners list view like the typical view that you come into if you go to the runners page. And we received feedback that. The experience filtering there isn't ideal because with tags. Specifically with tags every single time you go into that bar you have to add another tag. You have to say filter by tag add the tag and then say filter by tag add the tag and there's typically a lot of like there's pretty common sets of tags. So by allowing them to see that in a drop down. I don't know if I added a search bar in the this the menu. Yeah, so you could search for that tag and kind of like stay in one place and do it all at once. And then we just found we've also heard that it's not as discoverable when it's in the filter component because you don't know what filters are available to you. So I'm starting I haven't really edited what that page is going to look like in the future, but at some point we will. I'm going to improve the filtering for that list view. I don't know when it will be. Yeah, got it thanks for the. Take sort of insights. Yeah, I agree makes sense like you don't know what you can filter by right we repeat that. I feel there to search bar. Yeah. How about you also like show fields like below this. I'm mentioning all the tags that are selected because it's not a crowded space you have space. Yeah, because I mean, because this is the only thing that it's being filtered by and you just not being able to see all the tags which are selected. I would say that is problematic to click on the drop down and then get an idea about what this filter is all about. True, that's a great point. Initially wasn't planning on showing them all, but I think I could play around with just showing like the chips. Yeah, like the actual labels underneath. Yeah, I think that's a great addition as we to come and chin and then I also have just really really minor feedback. I just like I like that you're starting to play around with the drop down because I also could hear from you that the concern of using the current filtering bar patterns. Throke it love and then I know that we have a little bit of minor usability issue on that so I could totally get it. But I think my problem when I saw the design was like because I didn't think that the drop down is connect to the whole page. So maybe you could consider I don't know I'm just thinking out loud maybe adding a small borderline below the drop down so make. More visual higher to keep there would be helpful. Yeah, that's a good idea. I've also noticed a lot of other filter like when you use the filter component there's a gray background. Yes, I could try that out to. Yeah, maybe that would help like I guess, but I need to I need to see but you can definitely play around with it. Okay, yeah, thanks for the feedback. And then the one minor thing I wanted to say is I would be curious if people would clue into that being a filter more if it was on the right side over the left because I feel like filter and sorting place and get lab always seem to be on the right and I'm wondering if that would make it more clear or not. Okay, I'll try I'll try that too. I wasn't planning on putting this through solution validation. But now that we're talking about all the feedback I'm wondering if maybe I should just do a quick on. Unlaterated test. I don't know. Like I don't really know if I want to do that. I think it's I think it's going to be good. I just think if you have something coming up like any research that you have coming up, you can just like plug this question in. Yeah, because you implementing the very first version will not be problematic but later for making improvement. Blood this question into any research that is already scheduled. You don't have to like do something like dedicated to this. Yeah, that's a good idea. Okay. Well, thanks for all the feedback on the spot. I appreciate it. I will give it to Emily now. So I only have one announcement since I spent last week watching all the unmoderated interviews. What we've closed off the Kubernetes dashboard views with our improved preview that we were testing. We found out that users really liked it. They were able to troubleshoot, especially like the pod area a lot better than they were. Before using the single stats. So it's a great addition to the cluster UI. And the next steps are actually to work on moving this UI under the environment details page because we tested this on the environment list page. But we know we're running out of kind of space that page has a lot of problems with things loading and adding a big tree on that page is definitely not something we want to do. So we want to test out moving this over. And then also crafting up a more complex version of the tree just to see how it scales. But overall went really well. And I wanted to give a big thanks to Will who recommended this unmoderated test. We were able to complete the study over a holiday period, which I know is usually a slow period for user testing. And we were in to initially accepting to close this off in 168, but we did so thanks again, Will, for the recommendation for this. Yeah, thanks Emily. I did want to add here that you know, I think this overall process was really valuable to go through because. As I wrote the doc, we were originally planning to develop a whole another page. So we're going to have to like go through foundations team to try to get approval. I think Sengen is probably really familiar with with this process based on everything that happened last year. But through like Emily's design process and like collaboration with the P. and Victor. We ended up deciding like let's just keep it on the environments page instead of like having another page. But we, you know, have to like surface to users. So overall great work. If no one has any questions about this, I can pass it over to Vintka. Thanks Emily. I was looking for the link to your design. When I got lost in the position of the addition issue. Let me, let me post link to the figma actually because there's a tiny figma links lost in the issue, but I think it'll probably be easier if I just link directly. I mean without looking at the design, I would just share why I was looking for it because. You mentioned a good point like overloading a page is definitely not a good idea, but I was looking to understand if there is a possibility to provide a toggle between two views. Yeah, well, that's actually what we're looking to do in the details page. Like I've all between two views or two views you can access the problem with the list page right now as it has already so much information that I think added more information into it. Yeah, me, but it's the table overlocked page. Yeah. I just saw the tree view design also and I think it looks really it reminds me a little bit of the pipeline view like the I don't know what we call that tree. It looks all like a tree graph. Yeah, the graph I guess. I think it just looks very good lab. Yeah, I thought you did that was my first reaction that this looks like a graph from good love. Yeah, I used inspiration from that pipeline jobs graph actually because it's the only one in get love. I knew that kind of related size like I'm going to just use that as inspiration and see if I can work this tree into that design. So there's still a few small UX issues like think we have to clarify the arrows a bit more but yeah overall starting from there I think was a really good starting point. Thank you everyone. Yeah, coming to my point so Miran I you were able to make big changes to the way to boost management experience. I know that we are still calling it beauty find a far UI but we ended up like also doing some back in work. That was long pending which was around adding descriptions for variables so that it's easier for someone to you know find a variable that they're looking for because they might be. One with similar like a bunch of variables with kind of similar names that sometimes users create and it's very difficult to understand it is. Through a glimpse that which one was meant for what and why they were created. So now that's going to be easier but that's just one and we have made improvements with validations added a lot of them. We have improved almost like a bunch of health decks and changed than the interior the behavior of the input boxes made the drawer more pajamas compatible and also like contributed to the guidelines for jars in pajamas as a part of this. Overall this was I think a very successful one and we enjoyed a lot so expect a blog from both of us coming soon. The next one that I'm looking at right now is most dream research. I know that I've been talking about it in a very long time but it was really difficult to get people to speak with but I'm just very happy that finally we do have people and this is for the first time and. I would say ever that we have so many people who are willing to share that feedback about most trains. I'll be concluding this research this week and posting the analysis next week or like mid-off next week and I have a lot of insights that are valid for very different teams so just stay tuned. And that's all. I think I can take over and then just voice a. Bonnie's. Notes here she could use not attending. I think most of you have seen that you share the job token. Designed right in the CACD UX. And oh sorry this is the CACD UX. I'm talking at the Google level yes that's exactly the one so. If you haven't had a chance to provide her feedback. Please leave a comment over here the designs. I'm just dropping a couple of comments here and actually press that you know that she managed to use the design patterns and the whites it's really polished. I think there are a couple of things that we can provide feedback on especially on right. I'm just going to ask you a question on. Ording and then smaller interactions. But overall through nice to see her first prototypes her first design. Issue out there in the wild so. Good job Bonnie and also thanks for being there for more supporting her as her onboarding buddy. She made a. I don't know. The way she like explored all the different use cases for this feature and went into the real depth something that we missed the very first time when this this feature was being built on at project level. And we kind of built upon it over time but looking at how she made all those considerations. Before her very very first draft it was really commendable so yeah I appreciate our work on this. Yeah really cool. I'm going to leave a comment here in the document but also in Asia for her I think a good next step is to you know move that acceptance criteria and the comments that she's living in the designs area to the issue description because right about the behavior about the rules. Just the over our functionality it's good to have that in the Asian description. But if you haven't had a chance yet to review it please support Bonnie. And as you also post some questions and scenarios about the CI job token work. It's in I think is the validation issue yes this is the solution validation issue. I think you had a chance already right we to work with her on this one. Right yeah the noise was a really good question so she still has open now. I think Marcil and I we answered most of the questions almost all in fact I invited Marcil because I did not want this to be heavy on my perspective I just wanted someone to challenge what I had written. And yeah I think she has all the answers but still if somebody feels differently I would really welcome you to post your answers here. And Bonnie let us know because you probably watched this later on. And then there's two more point to additional points here she's also mentioning an next steps for that CI job token issue is to create a validation plan and start from the clean the validation so she can refer to Emily's word for dashboard on this one. Emily do you want me to voice a comment you want to voice a comment I never know how to what to do yes. It was just a funny needed any context or feedback around the solution validation that I just did a feel free to reach out and I can chat about it a little bit more. And I just have and if I know not really it's just a comment to tell her that she should create the recruitment issues so because it's not easy and get in touch with Erica. Is it Erica or will supporting the. I've been to Kyra to do to you. It's Erica. Yeah, it's very fine. Oh yes, since she also worked on the scar card and she referring to the one had a chance to see that. And I've cost more aspect that one of the suggestions of the recommendation that she's the she. That's a very good question. So, I'm also good to see right that. We'll mention an engagement also for customers on the community on the work that she's doing so think overall what he has been busy she hasn't had to just join this call us. But it's nice that she's also able to update us here about work so. So. And then if you don't have any questions, I'll pass it over to the studio. Thank you, Sian. So I have to item so the first one is about the think because I shouldn't that we did last week. So it was really great. We didn't chat about any design relevant elements because it was intended to just become a more of a technical discussion. Who was full of this question around how to use API should we change architecture. But I think it was great that I could hear a lot of from back in engineering perspective as well around this project. So. Okay. So it was really cool and we wanted to make sure that we're aligned on this in terms of the project planning perspective so we're working on the proposal from the back end architecture like planning so Bobbi was working on it and then we're also discussing. Shortly after the call and then we're keep discussing around this so the long story short while we're discussing at the moment is like how would the CIC catalog would like to become is it like get left catalog that includes a lot of different elements inside. One catalog or do we want to speak to become a Gillette CIC catalog that includes the ICD components with the city steps the city template type of component. So it's more of a discussion for the future vision and I'm happy that like we're discussing this so that we can make a proper design and product planning so that we can work on working towards the roadmap. And make sure we're aligned on the same goal so it went pretty well in my opinion and based on this we so it's only the empty issues so far but dove and I started to think about like we should validate if this vision really makes sense or not so today I just really quickly create an issue that the research issue service and deeper now. But I would probably need some of your feedback because we wanted to take this opportunity to test things out that is not exist in the market as well as it's not part of the product but we wanted to make sure if it is really aligning with the users needs or not. So it's that and my second item is also more of an FII that I also went through the solution validation it was during the holiday season and it was a moderated test or went fairly like well and. The good thing is so we wanted to test out the different visual by representing the component so currently if you check the CSE to catalog it shows one project in a row but we are asking ourselves like is it better to show the component inside the project. So it seems like it was well received but I I taught in one unrelated question to this research that how would you filter and find the components that are created by your colleagues to test out the filtering experience and actually we got a lot of constructive feedback on this we need more immediate action item. So yeah, but it was a good test and thanks Eric, if you're listening to this call for helping out planning the research issue. So yeah, if you're interested in let me know if you have better idea on how we are going to improve the filtering experience I think it would be a whole topic that I may want to share in the CSE to review meeting at some point. Any questions if not. I don't have a question you mentioned that you would want some help like some feedback but where do we go to provide that. I don't have a really well described issue but I have created one empty issue so I'm going to link it here. Where is the past sorry too many meetings. Thanks, Bill. Okay. So this is the issue that I'm going to work on in the next one or three months and I want to really revamp the whole filtering experience for example on question three needed tap here. And the second question like how does this filtering tap with the search full working well together and I'm pretty much going to start about using this pattern so I'm happy to explore alternative UI for this. Thanks for asking. So move over to hyana. So switch word updates we're seeing hiring. And the update I want to give to the team is that you may sort of change is to the role requirements that you can find the kickoff issue but also they'll review with you because most of you are part of well they're really team right. So the big change is that we are only interviewing or going to be hiring intermediate product designer so when assessing right in interviewing the candidates and also fill in this for a card. And we are moving them to the pipeline into the interview process considering them intermediate designers and also make some updates in which the priority of some of the skills both the soft skills and hard skills for this role so as you can see here. So 3 and 5 three to 5 anyways top 5 the theory skills is foundational research. I think for switch board there's a lot of have a lifting that needs to be done. And a product designer inexperience in research is really important they need to be very strong collaborators with you know the image and new in all the designers. I'm mainly looking for some on the has worked with the design team before or at least you know had some fair designers. We have interviewed designers that they were like the design team of one they were the only first designer in you know a startup etc. I think that especially for if you think of where switch board is right now where we are getting started with a lot of the core functionality of the user experience someone that has you know a bit the more of experience in collaborating with our designers to get the understanding the insights. All of how to use a design system that they are used to you know just figure in things out with a team think that's essential. If they are not already technical they are interested in the nation and CSS. So I'm sure if in your score cards you're interviewed you talk about that about those skills but. I would like them to at least. The you know proficient in basic HTML and CSS that mean to they're going to have a better understanding of design interactions that they will be able to communicate with the front end engineers right about the components that. When review merge requests they will just be able to jump in and. Do the work that we've done. And I already mentioned the usability interactions that we did to design system and experience working on complex products before I was really looking for someone that had the depth to experience. That's always tricky because it's a little bit such a specific work that you all do here. So complex products that can be like working banking you know and compliance in anything that really requires them to dig into this. And that's a messy hairy problems and showed that they cannot lie design iteration. To you know, propose a motion that they can use research skills that they think collaborate with their teams anyways involve engineering in their design process so. And I'm not sure that's what I'm looking for. And then I still have skills technical skills in general right. Like anything outside the scope of HTML and in CSS. As I mentioned, really nice if they have that tool that's to be experience maybe they're a user of GitLab maybe they I don't know the coming from one of our competitors. And also body and platform workflows or admin platforms experience that's also nice to have I think before one of my mandatory skills was that they had experience in onboarding design. But very tricky to find and combine all of that I think it's we make some tweaks there to make sure that we're not finding the right candidate on paper but that you know we find the right person for the job and that for the things that. They they need to improve this was an engineering proof that we create the opportunities for them to gain those skills. What changes I think to you mainly is you know only intermediate so if you think someone is at the intermediate level but they're like I don't know early intermediate or I don't know a very strong intermediate I'll like you to highlight that in your notes. And also when I say intermediate is like a GitLab intermediate right because a lot of other candidates that's. We interviewed recently especially end of our last year which was like two weeks ago. They had a title senior but they were like not GitLab senior right so it's difficult to not difficult but we have to. Kind of set that expectation with the who the candidates so I'll pause now see if you have any questions and if any obviously since so yeah that can I line. The expectations for the upcoming interviews. I just have one question I really haven't been getting any interviews for this role. So I was not sure if that was something was missing there or I was not sure. Yeah that has been the challenge and it's also why. We were making this changes to the the requirements. I've interviewed only a I don't know maybe. Six eight candidates in the the last four months that's not a lot right because initially the candidates that were being as creative that were qualify. They were and then that's going to answer to will question to expensive or there were two senior right they were good designers but switchboard is an area that. If if we put someone that is too senior they're going to finish the work like in a year and then what. We cannot risk like getting someone. Put is a one there so that's to be born right they it's a it's a problem area where the designers the design and they need to have them for growth right and need to be able to learn also in the fly for example. I think that's the experience in research but have never worked with a research team so they're going to collaborate with will right you going to learn something. So yes for this this role we haven't had so many interviews we had candidates that were screened and we're qualified and they moved to the team interview I think. VT coming me soon during interview a few of them but then rejected. After after a couple of of interviews. I think that's the first question that's great. I think you you kind of answered by first question so I did add a like another question. And then you know you've done you know you mentioned six to eight different interviews with some like more senior candidates. Are there any. Concerns that like intermediate candidates will still be able to match up well with what you're looking for for those top three to five. mandatory skills? Yeah, I think so. And that's the assessment we've made after having these interviews, right? And after also looking at the book of applications that we had. Right. I'm sure if I remember at some point I mentioned like I'm reviewing a thousand applications because a lot of people were applying. And as I mentioned, they are seniors where they're like not good senior. And if you will have the experience working complex products that we need or understanding research methodology etc. I do think we'll find an intermediate candidate at this level because farm and but correctly like Gina. Gina Emily and Tunjoon, right? You, the three of you, join as I think to be the level, right? But you all came with a very strong graduate, very strong experience in various specific things, right? And another thing we have to look at is that this team, you're all seniors, right? So looking at the business when we hire yet another senior in this team, right? There's all you're going to be so many staff and manager opportunities in the company. So we also need to think about that, right? The career path and development and room for the road for a new person in the team. So that's really it to the point I mentioned about, you know, compensation expectations for people there to senior depending on the location factors but also budgeting and career progression in the initial. The, as a two question or will. Yeah, thanks for going through that or me. And of course. And then a question. This is a little bit out of scope and if it's something that we can't talk about in the recording also in time of that. But as you mentioned that there's a lot of seniors on our team and that there's, you know, not every. The growth opportunities are only going to be there if there's like a certain amount of openings and etc. Are there any is there any work going on to maybe change up our. I don't know what the word is, but basically like the growth opportunities for product designers because right now like you're saying you're senior and then you're either staff or manager is there going to be like other opportunities in between that. Yes, I think we have a, I'm not sure if the merger class was version of things, so but I know that Valerie and and better to work here on the principal product designer, which is staff plus. Right, similar to what engineering and also product has that something that Christy was also working on because we need to make sure it's right that. Let's say after. Actually, you get promoted for example to senior product product design manager, you could become a director, but then what's in between right. It's a limbo that. That we need anyway, just this, a clarify and I know that this is part of the discussions. That leadership had at least, you know, last year, I'm not sure yet when this will become a. Let's say something that is in the handbook right of a job. Because we also need to have the business need for that. Right, so we didn't have staff designers in the past, right, we also didn't have senior design managers, so as we grow. We also have to make sure that we are not. We're not only adding people there are too senior because that also means we might lose them right at some point. That's all part of the changes for this particular role and also mainly because I think switchboard is complex, but it's not as large as for example. Verify right where yeah, you have a very well established set of functionality that yeah. That will require expertise that requires more senior designers. So yes answer a question, but I don't know what. Okay, thank you. Oh, the. Um, thanks for your questions, by the way, and I know that we are at almost a time, so I'm just going to drop my question here. I discussed this with some of you already, but. I want to see if you're all can help me. I have to disemble it to switchboard by the way, but I have to complete a UX score card as part of a Q4 okay are. That will require me to validate a job to be done right run a score card on a job to be done for a product area outside of CI to the outside of switchboard. I can pick anything, but I want to pick something that relates to verify in release. I'm sorry, verify any environments. It's an a room number that that changed. And my question to you is. Do you have any suggestions do any recommendations on. Cross stage job to be done that makes sense to be used for a score card that can help us, you know. Experiment or at least a sastic with the that that user experience. Taking that the recommendations will be beneficial to your product areas. That makes sense. It's late. What do you think. I have the same suggestion here that I shared with you and everyone on one. You help me like come up with this. I discussed for the designer with the other team of the other team which is go interviewing that's how like. I did not have a chance to find this for testing the usability of merging experience, which is a very wide experience. And I can totally give you the highlights the tags from the up to you that validate this. I would just need some time maybe tomorrow. I think appreciate it. I was thinking, I didn't discuss this with you, Sunjian, we didn't have time today, but I was thinking of a running job to be done, of the Reyescore card, also for one of the jobs to be done in Create, but related to the pipeline, like the editor experience, right, either the coal suggestions or using, I don't know, VS cold, whatever, using extensions, because I think that could be interesting to you, but they don't have jobs to be done for that category. So yeah, that's the type of thing I'm looking for. So I'm thinking secure could be cool. I think that could overlap with verify, just thinking about security widget, vulnerability, that all can expect to like, commit in pipelines. Yeah, that also makes sense because I think that's the way that you will or the Erica that it's Erica, that was working on a study or I think, and I think you see eye adoption and something about that related to related security and compliance work flow. Yeah, it's definitely Erica. It's Erica, right? Yeah, okay. Anyway, I forgot that, you have wheels. Part of the agenda, I'll just, oh, for now, unless will you want to, yeah, voice up coming here. Yeah, I saw that you added the link to the just to be done. Yeah, we'll file, so I was just kind of like, scrolling through it. And I came across this one. It looks like it hasn't been validated, but it touches its technically under distribution. So that's involved with, like, actually installing, get labed and then it touches on Kubernetes, which is covered by the environments team. So it looks like there's a couple different, like stages involved. So I don't know if that might be another area to consider, but unlike the one that Vita got had shared, I don't know if this is like, it's got the evidence behind it as much as hers does. Yeah, thanks, Will. I linked here the, the, the, the objective on the file. Yeah, I'll do some digging. You could just, you must be some additional information in, direction pages or these categories, this area, but appreciate the feedback. And then over to your world. Yeah, I don't really have a lot of updates. I did want to just add to what Emily said, earlier about our solution validation study, that I think she did a great job collaborating with Victor and myself on this work, and she was extremely efficient getting everything done, especially around the holidays. And she also did a great job like running the study in user testing and then providing us with updates on like each participant, asking me for feedback on like whether she needed to like, you know reject certain participants and kind of get new ones in, get higher quality feedback. And then she also consolidated all those individual sessions until like it overall. Summery, which was really detailed and awesome to see. But that's kind of it for me. Thank you, Will. And Emily, thanks for the shout out. Thanks everyone. Yeah. Yeah, I never worked. I mean, we want the, never, we wanted to, never, we want to. It's going to be forever on the internet. Thanks everyone for joining me. And first thing a little bit of time. Hope you enjoy dressing today. And that's me, Linda. Bye.",
  "Okay. It works. All right. Okay. Last team meeting of the year. I just want to start off by saying, it's been a crazy year. Thanks for being a crazy couple of years for everyone. But yeah, I'm really happy that we've made it. We have the people to be working with you all in 2022. Looking forward to much more next year. And I just wanted to ask this is anything that you have in mind that I'd like to share a ball's what you're looking forward to. Work related, no work related in the next year. For me, for example, I'm really looking forward to the GitLab. What are we calling that now? Are we calling it summits? We're calling it contributes summits, right? Yeah. I really hope it happens next year. Making all my string blends around it because it'll be super cool to make you all in person. But also, yeah, just to meet again, some of other colleagues in the subject. I think that's a high light from my GitLab. GitLab was just but also to higher the designer in switchboard. It's been a few months and boredom. So these are like my plans. And also something I'm looking forward to. And it can be quite annoying to have your manager ask you like, What do you want to share? But does anyone have something that they want to share in this last year? I'll have to say, was summits as well. So now I'm going to try and think of something else. But again, that's one that I really want to share. I have met many people from my immediate team. I have met a few people from our team, but it would be nice just to for the first time ever to meet like a big jump because of people I work with in person. Which will be really nice. I'm looking forward to figuring out what fleet visibility will look like next year. So like the first time I feel like I'm dealt with a brand new. Not really a brand new feature, but it's a new category for us. So it's the first time I've dealt with that. And I think it will be. Very fun to collaborate with a lot of groups because it's really cross group. Yeah, so I'm looking forward to collaborating and figuring out what that's going to look like. And some it will get on the summit train. Eric, could you want to say something? I was just like, I didn't want to. I said, no. Okay, then let's just be grateful for Eric. All right. This year and more Erica next year. To. Awesome. I think, yeah, I just before we jump into the agenda, just want to say I was not going to take some time off next week, but I will because it's just today's. And in case. Any of you, I know that Emily asked for my coverage for a few days, but if anyone else, that's going to be watching this recording. If you need a me as your backup simply assign yourself in get lab as busy and I don't forget, you know, to do that and also link to your coverage issue because. Yeah, from not able to cover it, we can point people in their requests to the coverage issue and it can leave comments there if you need it. Okay, then we do a start on top start from top yes, then over to Gina. I have a reminder that I'll be out of office for probably the longest amount of time I've ever taken here. So two weeks. And I linked my coverage issue there. Thank you for people who are covering for me. And then I have a few other items just for some ongoing work that's happening in early will in January when I come back. I'll work on a competitive analysis for or competitive evaluation for fleet visibility and. I will not state the competitors there, but I will be looking at, but you can read them. And then go into that issue if you want to see more Darren has already added actually a lot of screenshots. And then I'm also working on auditing existing research in summarizing that into a video about kind of like the broader pipeline performance or how to optimize my pipeline. Erica has done a lot of research in that area that I'm also going to be just like summarizing in one place. And so I'm not to my surprise there is a lot of existing stuff so we don't have to talk to more customers which is also nice because the problems are already validated. And then lastly, I worked on I worked with Graham and Alana who are two new product designers because they wanted to shadow someone while reviewing an MR so. And it was a really fun experience for me we were trying to get pipelines to be in the right states and I was like googling on the spot and. We were all just like working together they had GDK up on their instances as well and we were working together on it and it was very valuable so we. And I'm hoping that I'm able to add this officially to the onboarding template for product designers. You're welcome to jump in there. I have a comment on this one can I say I left a comment in the merge quest you know just in being a big company for feedback because. I will this help you and board bunny and they are do something similar. So I think they had this week the first merge quest shadow call they also were taking a call for like one hour so they might have some. Some feedback and I think it's a great addition because to your point right now that designers are assigned to randomly assigned to merge requests reviewing something out of sort of your stage. And even can be even scarier so I think in general doesn't opportunity to do that for us to also define when shoot that happen right and who should help them with. She'll have to mean the process so thanks for that mark. Yeah and also I met with be this morning and she was saying that she'll create another remark because I she had some larger ideas of how to. Kind of like time box a lot of the stuff that we have in the template so there's going to be more changes. After that but we were able to connect at least on the small change that I wanted to bring in. Throw on the same page there and she'll build on it. And that is it on for me. Emily. Well, um the first one is just an FI I that we're starting a new unmoderated study in 168 for a tribute on the Kubernetes dashboard. We're seeing like a lot of competitors have a tribute of this and it's a concept that we didn't initially explore when the Kubernetes dashboard was first validated so it's something we kind of want to. Sneak in there as we're working on it and a big thanks for well will's been kind of helping me with the screen here for this as well as the scenario so. Thank him for his help with this study. And then. The second thing I wanted to say is Andrew one of the friend and engineers on the team invited me to a Kubernetes meet up in Toronto last week which was a lot of fun. It was very very technical so a little bit above my knowledge. But it was nice to just go kind of network with some of the people working in this area making connections and we're also talking about maybe presenting our Kubernetes dashboard at one of these in the future. So I'm going to meet up with a Vittica to see if this is something I could do speaking about and partner with Andrew so he can kind of answer all the engineering questions that come up. But it was a lot of fun and I haven't done like an in person meet up for a while so. And if no one has questions move to Vittica who's not attending. So do you want me to voice it for her. So it's I'm talking so her first point is there's a discussion going on in PE on the time we show for duration created at started at and it'll be helpful for some young and Gina to for and she's like the epic for improvements. And then. Gina I noticed yours is read only but since we probably have time we can. Yeah, I can voice it. I brought this up. It's actually a really interesting issue. I would recommend going into it because it basically like the users saying that weren't misleading when we calculate duration for pipeline. I brought it up with a flea team just because we have a lot of overlapping features that have to do with duration and runners and wait time and everything like that. And I left a comment for Vittica because we have some specific customer recordings of how they use duration metrics and why they're using them to optimize their pipelines. And the just a summary of what the fleet team talked about. We kind of agree with the user that it is misleading because we're not including pending time in the duration, which is. I'm not saying any kind of weird. But anyways, I just she had asked me to jump in and just include some. User stories, I guess kind of what most like how customers are using this today. So that's what I did. Yeah, I can bust my comment to. I had my one of my new Vittica today and I told her there are some insights in one of the environments. That's where we searched issue. I think I did that maybe last year with summer. That has some explanation about what the release managers and that's up in the years when looking context of the payments right when they are in the pipeline pages. But looking at the point of production. What do they understand you know of that metadata what why are they looking for. When it comes to. The ratio of the pipeline or you know. Well, when it started running etc. So it might be interesting for her to look into that but also connect with you and you might have a lot of updated and more insight in that. But just as a reminder, I think related to what you said there's some connections right about those information that we need to make. For many different personas, a lot of people just go to those pages, especially the pipeline view. And look for something very specific. There's a wanna see one number or one tag. So keep that in mind when making this and coming nation, let's also look at the insights because we have them and if you're gonna find it. Ask me, oh my, oh my. Oh my no where it is, but it's it's there. And then research project is the environments dashboard redesign. I think. That's not the group level environments dash that's the original environments. Okay. Yeah, yeah, I think then you all have been a full school started and I finished that was before you join. And I think that's the main thing. But there I remember documented that in the off jail because we specifically asked about the order of the metadata and also. What they want to do. Why some of this info is relevant. But anyways, mission like one or two insights about that it's the environments dashboard redesign. Also just another small note about this. I know that the issue was about the pipeline duration and. What another thing that I was thinking about is that a lot of these metrics are. I think more useful at the job level rather than the pipeline level because each. Even if the same pipeline runs. A pipeline is designated for a project. If that pipeline runs multiple times the same it might have a difference at a job set run every time because jobs can be skipped in it whatever. So yeah, I think it's it's hard to think about this at the pipeline level just because there's so many changes that could happen with each run. And I can move on to our next point. We're done. And the next one is we need to get started. Butifying our UI in 168 there's many MRs that are merged already and now have validation in the form of that work. And I'll voice Bonnie's comment here if you want to take a look at the list of items. Maria and her are working on. I think that's just a question for Vita go and to watch this. I think it's the opposite. I think it's the biggest comment for Tika's comment to Bonnie. Okay, everybody. Yeah, that makes sense. Yeah, because Mida is in front of an engineer in Tinas. No, no, that's right. Mida is a sorry to many to many teams. You're right. No, so we're confused because it could be that 168 beautifying something with Hayes Lumi. Maybe with Mida. Anyways. Yes, they can take a look at the agenda. That's it for. Yeah, so Bonnie and Sinshu are not here. And then my only update for us which more is that still hiring, Steven interviewing. I don't have an interview scheduled for well this year and more. So hopefully by January we'll pick up with more interviews and fingers crossed hire someone. Good evening. And over to Eric. Yes, so I posted the link to the draft of the report for the runner and CI builders build. Belled feature prioritization survey. So we did a canos survey with 11 features to see how they got prioritized. The signal we would be looking for is that there was like one must have that we would want a champion. Actually, they were all either attractive or indifferent. So like kind of cool, but like nothing like that we have a clear signal to deliver on. Looking across the ones that were in the attractive bucket versus the indifferent bucket. We have a signal that users want AI assisted things like for example like custom dashboards are actually not compelling because it's more work for them. But if it can be like AI assisted then it's like attractive but still not a must have. And so Darren and Gina and I are going to go over that report and depth tomorrow. But I thought I was like give the high level overview that we don't have any must have so I think it means that we're on the right track with like figuring out those little optimizations suggestions which is a read we got from that qualitative study. And we wanted to do this just to make sure that there wasn't something that was like so cool across this bigger sample of users that we missed but we didn't so it kind of doesn't change the strategy in a way. I've also noticed that the not the sample was mainly small medium businesses. And I want yeah which is fine like I kind of had the assumption that they had different interests than the enterprise customers that we're talking to that are self managed. I we did have yeah it's totally right very keen. The thing is I think this idea that it would create more work still holds. Yes. So I agree but I guess my point is I feel like they have different needs because enterprise customers first of all are typically self managed bringing a ton of runners. So when I look at the features profile does attractive. I would imagine runner usage and compute minutes are higher up on that then for small business. Small or medium business. Yeah yeah I don't I I assigned a fidelity of signal score to to kind of help us make sense of it. I think what we can do is really look at the the the five features that are have strong. We have strong of it like a strong signal that they're in different to that's kind of the most. Okay, well it's like okay don't invest heavily in these okay yeah oh that's also so interesting though because. The notifications I don't know it's. Yeah because yeah because it's just it could end up really distracting them the notifications parts. Right. And then I think a lot of their flow. Yeah. I guess that makes sense but they're but then I guess does that mean that we just think about different ways of solving for when you're keep performance stinks. Or when your runners are. Erring out a lot like we have to figure out a different ways to give them that information. Or at least make the notifications like customizable as opposed to like across the board so it's like you don't want to get like all of their runners aren't important to them it might be like only the subset so like allowing them to. Opt in. Yeah but in model versus like opting out. Okay. It's like just we did just be really wary of creating. More things in there already busy. Yeah I don't I totally understand that this is really cool though Erica I'm going to look this is my first I'm actually seeing it so I'm going to look deeper into it and I think our meetings tomorrow. Yeah yeah and let me know like what what to do but I and I think it's a really good critique of the. Of of the sample that's like really on point I just think that. The the problems that we're seeing with those features should also have a problem like notifications for enterprise level but would skate that would scale that finding kind of right definitely yes. I was looking more at slide seven of the ones that are attractive because I figured the ones that are set they're set at week there I would have thought that they would be higher up for enterprise users but the findings that inside a definitely relate to all I totally agree. Yeah yeah so we can decide I think the thing is we didn't get a clear I mean I thought we might get a clear like chibby in here. I'm not really important that we don't want to like sprint towards any one of these particular visions and I think that like this AI assisted is the way that we want to be thinking about it. Like yeah behind the scenes they just wanted behind the scenes. Yeah okay I have some more questions but I don't want to take up a ton of time. I'm not a baro. Cool everyone don't you care. Yeah okay. And let me know if you want to sink today too. Okay. Yeah. And then or just slack about it and then the other study I'm working on is this conversational AI study which is like a team of researchers and I'm working with ops folks. And we are asking we did like an intro interview and then they're doing a diary study where every two to three days they let us know the tasks that they performed with conversational AI and how it went and they're giving us screenshots of those. And so we're getting a sense of how we might use conversational AI in the ops space. Although we think it's not related to performance optimizations like we got a signal that they that's inefficient use of their time. It's more like it looks more like they like it like as an idea generator or like getting the right language to use for documentation searches stuff like that. Anyway, but I'm threading the like really technical example tasks in that thread I linked and we'll we'll be doing the follow up interviews with them in the second and third week of January and so we'll be asking people to like give me follow up questions to ask about those tasks. Sort of put that on your radar and then the next thing is I was initially thinking that we would run that shared resources workshop at the summit, but I think we should do it after the summit because it seems like. I'll be like the only nerd being like, hey, let's work. Look at it. But let me know if you want to go rock climbing because there's a rock climbing issue that someone created. I work our rock climbing. That's all I've got. We can have the workshop while rock climbing. That's a good challenge. Okay, we're too happy with that. Let's go. But I think it's a good idea because yeah, you know, maybe some of us will also take some time off after some it's before right is some traveling. I think it's good. Well, once it gets confirmed, we can play around the summit for that and if not, we just, you know, pick a date in. You don't make you to things going to make you to right. Yeah, and if you work it to, yeah, I think it's safe for. Can we. Okay. Think that's that right we'll. Yes, already off. Anything else we didn't discuss we would like to share before we wrap out for the year. Good. This. Who? And thank you Emily for recording. This. Yeah, enjoy the rest of your day. I'll see you later. Final see you later. See you next year. Enjoy. Enjoy time off. Bye. Bye. Bye.",
  "Maybe you can, yeah. But I don't know where this is getting recorded to cloud on my computer anyway. Yeah, so I was saying that Sunjung, I learned a lot from the process that you were following and other learnings that came from that. And so like we thought that it's going to be good to kick it, kick it off as soon as possible, but not wait for everything to develop first and then think about right up like that. Yeah, yeah. This is the right way to go. Thanks for sharing. So my item on there is free a big and rather radical change from the CACD private catalog. So we we discussed this a lot and this came up and inspired me a lot. I did the journey map exercise and I didn't feel it's right to having this private CACD catalogs go for namespace because we have interviews several self-manage instance customer. It could be really multiple namespaces and not going to disclose to exact number, but it could be a lot of course it depends on the organization's size. And now dove announced this change and this will impact a bit of our product roadmap or the timeline. The design lies that impact is not that big, but I think this is the right way to go. So I was really supportive about this change and yeah, you can see that now we simplify the structure. So we'll have one organization catalog and one open source catalog that is kind of similar to the market. And I have personal updates so you can re-through it. I might need to reschedule some of our coffee chat or 101 if I need to. From next week until the end of September. I wanted to here with you all. So I am so excited. Yeah. Immodges are not working. Yeah. It's mostly common control shift that works for me to show the model or the modus. I use it a lot. I'm not ship story space. Okay, so my Anna is not here. So we can just go through this asynchronously. Maybe we can move to a research them. Yeah. Yes. So I am just analyzing all the sessions from how do we use AI to help users optimize their runner and CI builds. And it was pretty cool. We used like a decision tree process from this book on AI that I'm reading. And basically the idea is if you can put the decisions into like clear if then statements, then you have support that you can automate this workflow a bit. So we didn't know if it would be like I think about this, but that's related to this. And then this is really, but actually it's like pretty straightforward. Anyway, so I won't go into the results. But I'm working on the report. And another come out. I think I'll share with the UXR team soon and then it will come out next week. But there's really good information in there about just the details that people need to make decisions. And kind of the outcomes for optimizing pipelines. And the process is very trial and error. And set it and forget it. That's the main thing. So I think that's like one of our CI learnings just like the biggest thing I've learned. And get lab. They don't think of these things in their minds either. Like they specialize in it. They execute and then they go away. But I think that there's also findings related to how to support teamwork. So I think you'll like their report. And then next week or as soon as I kind of like get my mind into that report, then I'll start working on this. How users are using get lab on the cloud. And we'll do a little bit of a good question. Yeah, could you just elaborate a little bit more on the effort? Yeah. So I'm actually very proud of us as a product company that we're like ready to move into this space. So we're looking at kind of the connection points between get lab and the cloud. And like where the work flowing is. Kind of the tools that users are using. And that'll inform and part of the integrations that we're building. Like, June, which is DCP. But then also like long term what works well in terms of the integrating. And what does it? And that's actually where I think we can bring in some questions about resources and whether or not they should live at the project or the group level like how teams access like secrets for example. Like where does those get stored and get labed? And it is like higher up organization. Because I'm thinking a lot about this new. Chains that's coming related to organizations was to new nodes because that's like the new play with the catalog. Which I think is really smart. Which is to put it up there. But then I'm wondering like what else could we move up there? Like maybe the secrets because they're at their organized at this company level. But that's what we can look into. Talking about that Erica, I like can you like later go in chime into the issue that I've created for navigation. And like share your views there because yeah, we don't want Even though I have mentioned about like taking it out of CI CD. If there's any research that points that we should have it maybe as a part of the main navigation or out to higher level navigation. We should be aware of that and that would help us inform the methodologies that we would like select for research. Okay. I think we haven't gotten that detailed because that's actually like really tactical. Most of the research so far has been like what is a secret. But I'll look I'll look up the lens on there, but I think I won't have much. But I think from this study we might get something. Okay. And by the way, I will also pick this up based on your recommendation. Oh yeah. I'm listening today. You can read that chapter. I'll say it. Okay. I had. No, it's okay. I just have another like full hook question. Are you only looking at get lab. Sassy. There's always trying to read through your issue. And I mentioned that because one of the teams that I work with in enablements. Currently the application performance group is changing their name to cloud connector. Okay. And they're focusing on. Sumpman issues are essentially giving them access to like AI features and things that would be available through get lab SaaS, but at the self managed level. So that might be a good team to connect with. You know, in terms of this research. Okay. Awesome. Thank you. Right. I think we landed on the SaaS. Users. But not. Yeah, but either way, I think they at least be interested. So that's so helpful. Well, thank you. I'm embarrassed that I can't quickly find that in the issue. But it's okay. I'm on the other project. Yeah. So if you want to ping their entire group. I can list the the channel there. And then the P.I. can also list the PM as well. Okay. Cool. I just put thank you. Thank you. Well, go team. And then I have this this note. I have to find it in the, but I'm watching the sessions again and again. So it's coming. But there's just lovely quote about how we made a change. And the details people could see about the type lines completing. And this woman was like, I love it. I used it the other day to show my executives that I need more funding for my pipelines. Because I could show like kind of the times and how if we organize things, this would impact the times. And then she used that to find more of our product. So that's like the best. I can look this in your portfolio. Be prepared. Where are we showing the pipeline? Somebody. I'm sorry. Oh, no. I mean, I don't know. But when she was telling me, was that the new way that she can look at the metrics allowed her to make this argument. I need to pull up the, I'll pull up the quote. Okay. It was pre-owned. Any other updates before I go or. Yeah, the data technique. So I don't necessarily have anything. Connected to delivery or dedicated this week. I guess just a. Announce what I'm working on outside of that. Doing some research for organizations that I think Eric had talked about in the US week, the call earlier in the week. So I included the research issue and I've been. Constantly like adding and refining research questions there. And then I'm doing a workshop on breaking changes. Some adding people from different departments at the moment and can be doing that. It's going to be kind of a mix of async and synchronous workshop parts. I was looking for Jocelyn in the list because I mean, given how much she has been struggling with breaking changes and I see her there. Yeah, that was somebody who came up pretty quickly in conversations with the PM that I worked with Sam. He was like Jocelyn definitely let's include her. But if you have any other suggestions on who might be a good person to include. Let me know. Yeah. That's all the updates that I have this week. Okay, so with this we are at the end of the agenda. Anything that someone wants to bring up. If not, then the visit. It's in the meeting here. Bye everyone. Have a good one.",
  "Hey everyone, this is the CICD UX meeting on August 2nd. Starting with our standard topics with the, I had not wanted to mention the Q3, okay, as are being defined and will be available soon. So she'll share more info once the details are known. But two of the okay, as might center around the UX department completing the neuro diversity training and resolving usability benchmarking findings across FaireFI. So does anyone have any questions about those two? Awesome. So then we'll move into the product design section. I can voice Hannah's because there's important notice here about how she'll be providing coverage for switchboard at 20%. So hands on design work, milestone reviews and team rituals. And this will continue until that roll is back filled. And they expect to onboard five customers to get liad dedicated by the end of Q3 which puts a focus on the UX. So during this period, if you need support or she's blocking in any way, please be explicit about what's needed and you can ping DM on Slack where she's most responsive. And then currently working on email notifications and the onboarding flow, gathering requirements to improve design proposals for the deployments page for switchboard. So lots of updates to existing work and that'll be kind of where her focus time will be. And she shared a customer call from Switchboard on Monday. Think I'm next? Yes. Oh yeah. No, no, sorry. But if a no one has any questions, yeah, Gina, you can start. Okay. I have attached a report that I wrote up about the mental model research study. And there's a lot of good insights that came out of it. I'm working on recording like a video and sending it out today explaining a summary of that as well. But right now, one of our next steps is to run another survey, which is in progress and already have some data from it. So finalize the terms that we use to explain the concept buckets. And then we're also asking users where they use those things in their workflows. This will help us get a better idea of really what they think those words are. And then we can also use that to look at like pain points within the workflows that they bring up. And then the next item is that our next big thing for runners to look at runner cost visibility, which is focusing on users who bring their own runners. So we're not going to be touching shared runners on SAS because we use like our own pricing method for those users. And an example of this is like if you create a runner through AWS will provide you visibility and to how much that runner is costing you like the machine and to run the jobs and everything. So I attached the issue there, Darren added like a ton of details. And we're just going to work on scoping it down. But I talked with the team today and we're going to run a think big and think small on this because my goal is to have the process of getting the first iteration for this feature out faster than what we did for the NBC dashboard. So I think I'm next if no one has any questions. So I'm just making progress so so you can update it kind of artifacts for design sprint starting with issue templates and slide decks that you can reuse during the sprints. Just let me know if there's anything design sprint related you'd like to see template it out and I'll try and get to work on some of those. So some of the ones I haven't gotten to are each day of the sprint to those issue templates as well as I'm going to make videos that you can share asynchronously on how to conduct sort of these activities or the homework we were calling. So there's a few things I'm still working on but just wanted to share progress on that. The second thing being our we did internal research on populating a service list two weeks ago now we're doing external research. The good news is the results from both internal and external are really aligning, more seeing a lot of the same feedback from both which is great. So we're hoping to wrap that up in the next few weeks and move on to prototyping an NBC approach from this. Yeah that's a good thing that they're aligning. Yeah that's so we were worried about we were like I hope GitLab isn't using GitLab differently enough but there results will differ but there's a lot of the same thing which is really great. Okay there are no questions I can proceed with mine. So first of all thank you everyone for providing feedback last week on the secrets pucy prototype and you'll allow find our advice design on the same framework profile. The next step for me is to create an interactive prototype and share the link with everybody who has signed up for the OLE Adoptal Program for Secrets and then we'll just keep our fingers crossed to see what kind of feedback frozen. Beyond that I mean that that's a big thing that has that is about to be wrapped up this week so now I can start looking at see a job token and variable work again. Yeah besides that I have a chat with the application secure to team here at GitLab. I organized a meeting with our engineering manager product manager the security engineer from upseq MSF and it was really interesting so I tried to understand how is it that they are currently like how are their workflows related to secrets being fulfilled today with the current set of features that we're offering and they kind of walk through it and also contributed to the user story map that we've been working with. So we definitely have to keep in mind and one of the learnings was that we have to keep in mind the special responsibilities are special permissions that any security uh any any individual responsible for taking care of the security in any team organization would be requiring and that's going to differ a little from what we are going to be thinking for maintainers owners. So yeah this was a really good meeting for us and that's a oh if you don't have any other question I can move on to mine um I don't have so much to share for this week um so we had a meeting last week and this is this is this huge that I learned here is the outcome um so we decided to take a step back and then just like let's just forget about like everything and then we just focus on the user flow and then their context and then see what is the best solution for them and in which context are they starting to author the CIMO plot pipeline or maybe they want to come in to the CIMO and then maybe they want to just make some edit and then probably that's the point that they started looking to the CIME template component. So I'd like to just list down all the possible context and then make a journey map for each workflow as it seems like CINA has one question they want to verbalize your question CINA. Yeah it's a little it's kind of related I guess um I just had a question on the progress of the CISCD catalog and the navigation effort because I saw in that page now that Foundation team isn't allowing navigation changes until January of next year and I was wondering like how that impacts your team progress. I think of of course it's I don't know at this point because we are ready to start to take a step back and then I based on the outcome that I come up with like with the journey map or whatever design that we are going to discuss okay which is the best placement. So the short answer would be no I guess so from mind-resenting so okay probably the project navigation is the best location for this reasons then that means we can still ask for the request for the Foundation Pman and have those conversation back with better back up from the UX perspective and then also from the UX our perspective so I I you didn't think it will be blocker for us but at this point where you just like decided okay let's like a huge step back so I don't know we would be a plug or not just to answer your question. Yeah it does um one of the things I'm in our team call her runner today we were bringing up the fact that our project runners views and settings and everywhere else it's in the navigation like in build or in admin areas still called CICD but same thing and I was like yeah I I'd mentioned that your team pipeline authoring is like going through this and it's been quite a struggle um and yeah I'm just I'm a little nervous considering what I've seen from the stuff that you've gone through already so I might end up talking to you more about it depending on I might create an issue just to get like their input so far because someone actually commented about it on the navigation feedback issue they're like why is runners still in settings for project when it's not in any of the other views so maybe that helps but we'll see yeah so my solution would be maybe you already started to getting more numbers and data and also those verbal feedback from users and then just be ready to have those conversation with the foundation in one year really sure about like okay this is the good place for the runner yeah that'll be my only suggestion thank you yeah thank you my issue is also going to come in so I'm going to join the band in a while yeah and I think to genus one that most things that we are placing in CICD settings I'm not like very aware of what's happening with the other settings option but CICD settings those particular items are facing discovery, discovery, discovery, quality issues and I think we just need to see that what we can do and it's impacting kind of silly person the item that's inside the settings so it's not just about runners and variables it's about like how can we collectively improve the visibility of those items overall and yeah it would be a great chance for us to collaborate on this yeah totally agree yeah I just wanted to add that that are protected environment settings are there and we've had a lot of like user feedback that no one can find are protected environment settings so oh yeah yeah I remember that looking and that one is pretty divin the setting yeah it's deep and it also is sitting in an area that people are expecting it to be in and it's not linking you can't link it to the edit or just we recently started linking it from the edit environment but before you go to edit environment and it wouldn't be there so that was even more confusing I have an observation there that in most of the other products because we did a competitive revolution recently so I was just like passively looking at there are many options our like anything that's placed under settings in any of these sections I actually cascading in two steps and that's not the case with other products they have their settings navigation separate from like everything all together so doesn't feel like everything is very hidden you mean they have it like in a separate like almost on the separate level pile yeah yeah I see what I mean yeah and the one thing I noticed is sometimes we just put things like two kind of figure also when sites the setting and is it really setting or is it something to configure and yet that's sometimes confusing to me so maybe this is a good opportunity for all of us to I don't know just some fun work like settings you why version two yeah yeah well yeah we even talked about just removing protected environments from the settings and just moving it into the edit environments page because we're like that makes so much more sense for just actually in just actually those yeah and then maybe have an overview in settings but like I don't know it for us it doesn't quite make sense while it's sitting there yeah and just some a different kind of semantic grouping like for example verbose tokens secrets they would all of be kind of managed the same way but they'll be scattered all across even if it's on the same page let's see well think of something whoa yeah just wanted um if there any other it looks like research is both away this week so I don't think we'll have anything from them oh does anyone else have any other questions if not we can end this slightly earlier oh that one has a great rest of your day",
  "other. All right, today is the 19th July and we are meeting for CICD UX discussions. There are some stunning topics. There's just one impact which is by me. So in by playing security, we are kind of experiencing something like we are getting community contributions, which are not directly related to any issues. And those contributions, they are not very small in nature. So what ends up happening is it kind of like, and some being in conflict with something that we already have plans for and we try to make changes of that, we can accommodate it like we can take some parts from the contribution and get it implemented. But the discussion has been like going really long on those. And so Jocelyn and I we thought like maybe we should bring it up with the contributor success team. And that's the discussion that's going on there. So probably they might bring in a couple more automations to the process or some additional label that would require contributors to ensure that they at least look up for issues which are relating to the change that they are proposing. And that would also help us make sure that we are not discouraging anyone from making contributions because of course if we just continue the discussions for a month or more than that and just keep on changing, making changes to the decisions. It's not, I would say for someone who's taking a time from their personal time to do this work, it's not a great experience for them. So yeah, I'll keep everyone posted on what we decide or changes the contributors success team decides on rather. But this is this lack thread, but it's all happening. So if you want to just follow up. Yeah, Gina, do you? Yeah, because this happened to me as well and it gets a little frustrating especially for designers because we tend to have to go back in like retroactively design based on the contribution. And for runner we saw it was the same contributor every time who was doing it. So we ended up talking with the contributors success team and then met with them plus the contributor and kind of like talks about our roadmap so that we talk about our roadmap and also what they were thinking on from their roadmap so we can come together on those things. And what I suggested, I mean, obviously we have to like be open to them contributing. So I suggested that if they have like a new feature that they want to create, they create an issue first and tag me and that puts a lot of responsibility on us but I also think it gets us involved earlier. So that's what they've been doing lately and it actually has been helping a lot in regards to like making sure it fits in with the features that already exists or that we even like see coming up in the roadmap. Yeah, that's a very relevant example. So like this is case by case like for your team writing but to make sure that we come up with something that's generally applicable to everyone it's adding. Good for the contributors success team to come up with some new rules probably. Okay, if there are no more comments, let's move to product design. So for the first section which is which for Hannah has some updates that she's working on the backful requirement for all this position and if there's anything that any of the team members have been working on with the relief, they can just let her know so she can work on finding alternatives. Any other, I think NFI for Emily that the bears would be rotated by the end of July and for the rest of us as well of course. Yeah next is Gina. Yeah, I'm going to drop a little bit early from this meeting but also the things that I've been working on are mental model research for runners which I completed and thank you, Erica's not on the call but if she washes the recording, she helped me a ton with this project. So yeah, thank you, Erica. And she gave me a skeleton of a report to be able to fill out with all the analysis and still working progress but you're welcome to check it out. I also added a summary to the issue though. So what came out of it was to find groups of the runner concepts that users think about when they're using runners and then we also had them like come up with their own terms to describe certain definitions which almost all were not aligned with what we use at get lab but conceptually you saw some connections there. They just weren't the exact same terms. And then the final exercise was to have them match the terms to definitions like the terms that we used to get lab to the definitions and most of those they did they were not able to match accurately as we define them at get lab. So there was a lot of learnings but what I'm seeing now is the next thing I want to do with that Erica suggested is work with the team to come up with names for each group of concepts and then we're going to send out another survey to like a hundred participants if we can get that many and have them select which name like they feel best describes the concepts in that group and then ask them where they're using that and they're workflow and what tasks they're using it for. So then we can figure out how we want to make changes from there like if I wanted to make the design changes for that configuration example that I shared last week that would be like a way to help us validate that that is needed. But what I'm seeing now is to have the team is very it's difficult for the team to like understand that these concepts were grouped together because it doesn't align with how runner actually works. So yeah it's people are having a hard time looking past like the technical way that it works and then how people are grouping them and I was wondering if anyone has run into that problem and kind of how you're approaching it with your team. Will do you want to ask your questions? Well I did want to give you space to see if anybody has like thoughts on the question that you just raised because by questions a little bit unrelated. Okay. I think what Emily did with environments was something similar because they challenged the existing ideas of concepts that were like that were there since forever in GitLab. So I don't know maybe Emily any insights like how did the team take take it when they learned. But this was rather something that the team was involved in. So probably that's how it was different because it was not coming from outside but from discussions within the team. So the buyer would have been on the boat somewhere. We also had a lot of research to back that our current feature wasn't working. So I think that made it easy to convince the team because through like the group of environments research additional research before we were aware like this feature wasn't really hitting the mark. So collectively I think it was much easier to move forward versus yeah it coming from someone else. Yeah which is totally different in our use case because people are very happy with runners. It almost feels like we internally because we're touching it all the time. We have a much deeper understanding of it than our users, the majority of our users I would say but also the admins or platform engineers who are managing their own runners have a very similar understanding as we do. So it's hard to get it's hard for me to be like they're not understanding it when we know that they are because people love the feature. We want to think that helped us like I know we are at a very I would say nascent stage in the entire native secrets manager concept but one thing that helped us was the competitor evaluation because like the entire team got to like take a peek into how the rest of the industry is referring to different concepts and that also helped them relate with the research data that Erica had like greater reports on. So everything together they were able to relate one thing to another and that helped in like gain that conviction. I did definitely start with that. I have like a Google Doc with competitor terminology in it but I didn't really share that widely with their group so that could be a bit places to start a person. Thank you. Yeah, I just just certainly back to my question. How did you decide to get survey data or you know target 100 people? Yeah, so Erica suggested that we run the survey for I think a month and a half I think it was or we or when we get to 100 people like whichever one comes first and I she was saying 100 because like that's the average number that they've been seeing trends lately from surveys but if you have other suggestions I am very open to it. Yeah, I've used like survey sample size calculators which I can certainly link to here. So if you know like how many people are using a particular feature because I know that we have like it a lot of internal metrics on like who's a user of this stage group or that stage group. You could use that as a little bit of a guide and to like okay if our population is x. Then we should survey this many people to get somewhat of a representative sample size but yeah I'll include one below. Okay, I think another thing was that I was kind of saying that we need to move fast with this so she probably changed her answer based on that. Okay, yeah I mean that that certainly plays a factor too. Yeah, yeah but I still would like to look at that survey sample size and see what we do. Yeah, so I added a link there. If you click into it you'll notice that it has like three different sections. You don't really have to mess with confidence interval or margin of error. You would just have to enter the population size. So that's the number that you would have to either guess to me or you know get some analytics on to populate that field. Okay, thank you. This is nice. Great, the hearing will. Yeah, so is everyone that I noticed they're still typing going on. We're good. So just a small update with the outcome of the design sprint. We're trying to figure out the best way to go forward with the research here and we've started with a just internal customer interviews with the SRA and delivery team around the service concept getting a better idea of what they consider services. How we would populate that list and after we're done those internal interviews which I think they're like six happening this week. A big thank you to Victor for scheduling them. We'll be able to move forward with like external user testing just an update on that front. The other one is I'll be working on the design issue around designing for external jobs and I believe this touches kind of like the job details page, the jobless page and the pipeline details page. I'm not sure if any of those funnel into the verified teams that have designers but if they do just let me know so I can involve you and kind of feedback for these pages. I can help because I like I took part in a lot of free searches for those pages so I can help with any feedback but otherwise there's no designer for pipeline execution. I can also help because runner has a very small portion in this but there is at least a link to the runner that runs the job and then there's a lot of output from runner in the job log that might be helpful. Yeah this is mostly just designing it around this new like external job thing and what visuals will show but I think it'll touch like all of these pages. So figuring that out as I go forward. Yeah and also please slip mean because pipeline all thering it's not just owning but we are also touching some pipeline details page and then job log as well so I'm happy to help. Thanks a lot. Have you liked can I ask a question just on like what external job means? Yeah so this is one that I'm just starting into so I have to kind of look for it that this is as far as I know a say I job that's being executed outside of get lab. Like like on actions so for example on actions okay. No worries it's so what this is is I'm reading this out is like adding a new job status so it will represent the jobs that are currently being executed by a service external to get lab. So adding in like a pending kind of state as that is being run and then yeah so I'll actually link the engineering issue here that explains it a bit more than the design issue. Um That is helpful. I'm also reading the epic and it says external jobs are not picked up by a run and so it might not even can actually mean and if so you don't have to work me in. I mean I heard about this use case in some pre-searchs and also in the conference lately but I don't know I still cannot drop a runals it I need to read through this. Yeah this is new um for 163 I just started looking into it so as I learn more I'll reach out but it's a fairly new um being more looking into so I don't have all the details right now but I'm sure over the next week I'll have more. Okay. Okay. That's it with me. Then I will take up and so I'm mostly focusing on just one thing besides a couple of our community contributions this week that's the like finishing the POC prototype so I created the user map and flow on big jam it looks so good and um based on this particular story mapping I would be like designing the different pages or the different actions for this flow and that's for this. Another thing that I wanted to share was I'm starting to add like I added a slot to my calendar from starting next week for every Thursday morning. Kind of a time that suits all of us like all the members in the CI CD team at least and this is for like to have a sync time with me to discuss just anything that relates to public presence. We can just like use this sync time to discuss a block proposal to edit a block that's already there to like write abstracts select conferences designing content representations. I mean just anything that comes to your mind if we can use this time for that and to be like how you can add yourself you can just like go to the link add it to your calendar and for a whichever week you have booked it others would not look it for that particular week. Yeah and that is it. Yeah you could just do I like I noticed it goes to a calendar block. Do you get notified or do we have to like book it with you to let you know um let's try. I don't know if that happens because when I clicked on it it just goes to a calendar event but no one's invited to it so. Yeah okay I'm also not a part of what that is amazing. Okay now I am. I'll work further on this. Does it look very full? Well some links are getting it together. Yeah are we can just like sync runes like catch up over slack and just book slots manually this doesn't work. I'm not so good with automating things. And that's it. Yeah so in the new you can take it out. No I just wanted to say plus one but yeah it's my turn okay. So I'll type it later. So things be to Kat um I have two items that I like to share that um dove and mark and myself we're planning the Q3 that what could be the CSED catalog beta and then what could be included technically and also from the user standpoint and it's almost like divine and then we also announce a true to team and then now team is some board so that's exciting that means so just to tell you a little bit of more details we will gather more and made a data from now on so that we just just don't need to hold like this depend on the repeat.mb that user right and then this is your component a and b and c like for now like we have to just let them write everything and then just hold the depend on this instruction but you like to kind of provide a better assistance and suggestion system um so this is exciting for me because it'll open the doors for the further UX opportunities that I like to share this and the other point is probably you might see this in the MR's pipeline path um there is a now failed job number is surfacing in those tabs so that was the idea for this packathon and then luckily we get a lot of positive feedback at the same time we started to get a lot of bug reports. For example there is four failed job but so we just have a zero failed job and with even with the tabo emojis like oh okay we should fix it now so we're also working on this it's just popped up but it's exciting that people had a coming in and as they and then if you also have any other feedback please please let me know I'll also link the app to your issues so that you can leave some feedback around UX and also the UI pack as well. I think this was a really good improvement like a tiny one but so impactful. Yeah I was excited and then yeah we will have more issues. Thanks um every case on leave so moved with over to Bill. Thanks, Andrew. So I just wanted to quickly touch on additional point about the survey calculator that I spoke about a couple minutes ago added some information earlier on but I would just recommend you know working with your researcher if you decide to use one of those types of tools to figure out what's the appropriate like margin of error and confidence interval because if you leave it as is that those things are more like academic standard so tell you that you need probably more than you really do so if you have like tight deadlines or you know whatever it might be you might have to adjust that a little bit to get a better sense of what's a more reasonable number of people to survey. Outside of that I'm going to be a leave starting next Monday. I'll be out for four weeks so I'll get back second half of August. I've created my Q3 prioritization issue and linked to that here. A lot of the stuff that's represented there is just carry over from this quarter that's still active and then I'm going to be picking up some projects that are paused. And then since Ali has departed get labbed, coordinating with the PM Lauren and then Hianna to determine next steps for the solution validation project he was leading. So we're meeting on Thursday to discuss this more in sync haul but we're also having a synch discussions about it. If Hianna's going to be able to drive it while I'm out if we're going to just kind of keep it paused for the next couple of weeks until I'm back those sort of things. So that's what's going on with me right now. Enjoy your family time. Yeah. Yeah I need it. Yeah my wife goes back to work next week for the first time in like 12 weeks. So I'm going to be on full-dad duty 247. So give it her a little bit of a break. Okay so with that we have at the end of the agenda anything that anyone wants to bring up. If not then let's play more time back. Yeah let's meet later. Fine."
]